GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: CLKRCLK
#define CLKRCLK CLKRCLK
CLKRCLK                                  equ 003Ah
// bitfield definitions
CLKRCLK_CLK_POSN                         equ 0000h
CLKRCLK_CLK_POSITION                     equ 0000h
CLKRCLK_CLK_SIZE                         equ 0005h
CLKRCLK_CLK_LENGTH                       equ 0005h
CLKRCLK_CLK_MASK                         equ 001Fh
CLKRCLK_CLKRCLK0_POSN                    equ 0000h
CLKRCLK_CLKRCLK0_POSITION                equ 0000h
CLKRCLK_CLKRCLK0_SIZE                    equ 0001h
CLKRCLK_CLKRCLK0_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK0_MASK                    equ 0001h
CLKRCLK_CLKRCLK1_POSN                    equ 0001h
CLKRCLK_CLKRCLK1_POSITION                equ 0001h
CLKRCLK_CLKRCLK1_SIZE                    equ 0001h
CLKRCLK_CLKRCLK1_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK1_MASK                    equ 0002h
CLKRCLK_CLKRCLK2_POSN                    equ 0002h
CLKRCLK_CLKRCLK2_POSITION                equ 0002h
CLKRCLK_CLKRCLK2_SIZE                    equ 0001h
CLKRCLK_CLKRCLK2_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK2_MASK                    equ 0004h
CLKRCLK_CLKRCLK3_POSN                    equ 0003h
CLKRCLK_CLKRCLK3_POSITION                equ 0003h
CLKRCLK_CLKRCLK3_SIZE                    equ 0001h
CLKRCLK_CLKRCLK3_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK3_MASK                    equ 0008h
CLKRCLK_CLKRCLK4_POSN                    equ 0004h
CLKRCLK_CLKRCLK4_POSITION                equ 0004h
CLKRCLK_CLKRCLK4_SIZE                    equ 0001h
CLKRCLK_CLKRCLK4_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK4_MASK                    equ 0010h
CLKRCLK_CLK0_POSN                        equ 0000h
CLKRCLK_CLK0_POSITION                    equ 0000h
CLKRCLK_CLK0_SIZE                        equ 0001h
CLKRCLK_CLK0_LENGTH                      equ 0001h
CLKRCLK_CLK0_MASK                        equ 0001h
CLKRCLK_CLK1_POSN                        equ 0001h
CLKRCLK_CLK1_POSITION                    equ 0001h
CLKRCLK_CLK1_SIZE                        equ 0001h
CLKRCLK_CLK1_LENGTH                      equ 0001h
CLKRCLK_CLK1_MASK                        equ 0002h
CLKRCLK_CLK2_POSN                        equ 0002h
CLKRCLK_CLK2_POSITION                    equ 0002h
CLKRCLK_CLK2_SIZE                        equ 0001h
CLKRCLK_CLK2_LENGTH                      equ 0001h
CLKRCLK_CLK2_MASK                        equ 0004h
CLKRCLK_CLK3_POSN                        equ 0003h
CLKRCLK_CLK3_POSITION                    equ 0003h
CLKRCLK_CLK3_SIZE                        equ 0001h
CLKRCLK_CLK3_LENGTH                      equ 0001h
CLKRCLK_CLK3_MASK                        equ 0008h
CLKRCLK_CLK4_POSN                        equ 0004h
CLKRCLK_CLK4_POSITION                    equ 0004h
CLKRCLK_CLK4_SIZE                        equ 0001h
CLKRCLK_CLK4_LENGTH                      equ 0001h
CLKRCLK_CLK4_MASK                        equ 0010h

// Register: NVMCON0
#define NVMCON0 NVMCON0
NVMCON0                                  equ 0040h
// bitfield definitions
NVMCON0_GO_POSN                          equ 0000h
NVMCON0_GO_POSITION                      equ 0000h
NVMCON0_GO_SIZE                          equ 0001h
NVMCON0_GO_LENGTH                        equ 0001h
NVMCON0_GO_MASK                          equ 0001h
NVMCON0_NOT_DONE_POSN                    equ 0000h
NVMCON0_NOT_DONE_POSITION                equ 0000h
NVMCON0_NOT_DONE_SIZE                    equ 0001h
NVMCON0_NOT_DONE_LENGTH                  equ 0001h
NVMCON0_NOT_DONE_MASK                    equ 0001h
NVMCON0_nDONE_POSN                       equ 0000h
NVMCON0_nDONE_POSITION                   equ 0000h
NVMCON0_nDONE_SIZE                       equ 0001h
NVMCON0_nDONE_LENGTH                     equ 0001h
NVMCON0_nDONE_MASK                       equ 0001h

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 0041h
// bitfield definitions
NVMCON1_CMD_POSN                         equ 0000h
NVMCON1_CMD_POSITION                     equ 0000h
NVMCON1_CMD_SIZE                         equ 0003h
NVMCON1_CMD_LENGTH                       equ 0003h
NVMCON1_CMD_MASK                         equ 0007h
NVMCON1_WRERR_POSN                       equ 0007h
NVMCON1_WRERR_POSITION                   equ 0007h
NVMCON1_WRERR_SIZE                       equ 0001h
NVMCON1_WRERR_LENGTH                     equ 0001h
NVMCON1_WRERR_MASK                       equ 0080h
NVMCON1_NVMCMD_POSN                      equ 0000h
NVMCON1_NVMCMD_POSITION                  equ 0000h
NVMCON1_NVMCMD_SIZE                      equ 0003h
NVMCON1_NVMCMD_LENGTH                    equ 0003h
NVMCON1_NVMCMD_MASK                      equ 0007h

// Register: NVMLOCK
#define NVMLOCK NVMLOCK
NVMLOCK                                  equ 0042h
// bitfield definitions
NVMLOCK_LOCK_POSN                        equ 0000h
NVMLOCK_LOCK_POSITION                    equ 0000h
NVMLOCK_LOCK_SIZE                        equ 0008h
NVMLOCK_LOCK_LENGTH                      equ 0008h
NVMLOCK_LOCK_MASK                        equ 00FFh

// Register: NVMADR
#define NVMADR NVMADR
NVMADR                                   equ 0043h

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 0043h
// bitfield definitions
NVMADRL_NVMADRL_POSN                     equ 0000h
NVMADRL_NVMADRL_POSITION                 equ 0000h
NVMADRL_NVMADRL_SIZE                     equ 0008h
NVMADRL_NVMADRL_LENGTH                   equ 0008h
NVMADRL_NVMADRL_MASK                     equ 00FFh
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h

