GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: MD1CON1
#define MD1CON1 MD1CON1
MD1CON1                                  equ 006Bh
// bitfield definitions
MD1CON1_CLSYNC_POSN                      equ 0000h
MD1CON1_CLSYNC_POSITION                  equ 0000h
MD1CON1_CLSYNC_SIZE                      equ 0001h
MD1CON1_CLSYNC_LENGTH                    equ 0001h
MD1CON1_CLSYNC_MASK                      equ 0001h
MD1CON1_CLPOL_POSN                       equ 0001h
MD1CON1_CLPOL_POSITION                   equ 0001h
MD1CON1_CLPOL_SIZE                       equ 0001h
MD1CON1_CLPOL_LENGTH                     equ 0001h
MD1CON1_CLPOL_MASK                       equ 0002h
MD1CON1_CHSYNC_POSN                      equ 0004h
MD1CON1_CHSYNC_POSITION                  equ 0004h
MD1CON1_CHSYNC_SIZE                      equ 0001h
MD1CON1_CHSYNC_LENGTH                    equ 0001h
MD1CON1_CHSYNC_MASK                      equ 0010h
MD1CON1_CHPOL_POSN                       equ 0005h
MD1CON1_CHPOL_POSITION                   equ 0005h
MD1CON1_CHPOL_SIZE                       equ 0001h
MD1CON1_CHPOL_LENGTH                     equ 0001h
MD1CON1_CHPOL_MASK                       equ 0020h
MD1CON1_MD1CLSYNC_POSN                   equ 0000h
MD1CON1_MD1CLSYNC_POSITION               equ 0000h
MD1CON1_MD1CLSYNC_SIZE                   equ 0001h
MD1CON1_MD1CLSYNC_LENGTH                 equ 0001h
MD1CON1_MD1CLSYNC_MASK                   equ 0001h
MD1CON1_MD1CLPOL_POSN                    equ 0001h
MD1CON1_MD1CLPOL_POSITION                equ 0001h
MD1CON1_MD1CLPOL_SIZE                    equ 0001h
MD1CON1_MD1CLPOL_LENGTH                  equ 0001h
MD1CON1_MD1CLPOL_MASK                    equ 0002h
MD1CON1_MD1CHSYNC_POSN                   equ 0004h
MD1CON1_MD1CHSYNC_POSITION               equ 0004h
MD1CON1_MD1CHSYNC_SIZE                   equ 0001h
MD1CON1_MD1CHSYNC_LENGTH                 equ 0001h
MD1CON1_MD1CHSYNC_MASK                   equ 0010h
MD1CON1_MD1CHPOL_POSN                    equ 0005h
MD1CON1_MD1CHPOL_POSITION                equ 0005h
MD1CON1_MD1CHPOL_SIZE                    equ 0001h
MD1CON1_MD1CHPOL_LENGTH                  equ 0001h
MD1CON1_MD1CHPOL_MASK                    equ 0020h

// Register: MD1SRC
#define MD1SRC MD1SRC
MD1SRC                                   equ 006Ch
// bitfield definitions
MD1SRC_MS_POSN                           equ 0000h
MD1SRC_MS_POSITION                       equ 0000h
MD1SRC_MS_SIZE                           equ 0008h
MD1SRC_MS_LENGTH                         equ 0008h
MD1SRC_MS_MASK                           equ 00FFh
MD1SRC_MS0_POSN                          equ 0000h
MD1SRC_MS0_POSITION                      equ 0000h
MD1SRC_MS0_SIZE                          equ 0001h
MD1SRC_MS0_LENGTH                        equ 0001h
MD1SRC_MS0_MASK                          equ 0001h
MD1SRC_MS1_POSN                          equ 0001h
MD1SRC_MS1_POSITION                      equ 0001h
MD1SRC_MS1_SIZE                          equ 0001h
MD1SRC_MS1_LENGTH                        equ 0001h
MD1SRC_MS1_MASK                          equ 0002h
MD1SRC_MS2_POSN                          equ 0002h
MD1SRC_MS2_POSITION                      equ 0002h
MD1SRC_MS2_SIZE                          equ 0001h
MD1SRC_MS2_LENGTH                        equ 0001h
MD1SRC_MS2_MASK                          equ 0004h
MD1SRC_MS3_POSN                          equ 0003h
MD1SRC_MS3_POSITION                      equ 0003h
MD1SRC_MS3_SIZE                          equ 0001h
MD1SRC_MS3_LENGTH                        equ 0001h
MD1SRC_MS3_MASK                          equ 0008h
MD1SRC_MS4_POSN                          equ 0004h
MD1SRC_MS4_POSITION                      equ 0004h
MD1SRC_MS4_SIZE                          equ 0001h
MD1SRC_MS4_LENGTH                        equ 0001h
MD1SRC_MS4_MASK                          equ 0010h
MD1SRC_MS5_POSN                          equ 0005h
MD1SRC_MS5_POSITION                      equ 0005h
MD1SRC_MS5_SIZE                          equ 0001h
MD1SRC_MS5_LENGTH                        equ 0001h
MD1SRC_MS5_MASK                          equ 0020h
MD1SRC_MD1MS_POSN                        equ 0000h
MD1SRC_MD1MS_POSITION                    equ 0000h
MD1SRC_MD1MS_SIZE                        equ 0008h
MD1SRC_MD1MS_LENGTH                      equ 0008h
MD1SRC_MD1MS_MASK                        equ 00FFh
MD1SRC_MD1MS0_POSN                       equ 0000h
MD1SRC_MD1MS0_POSITION                   equ 0000h
MD1SRC_MD1MS0_SIZE                       equ 0001h
MD1SRC_MD1MS0_LENGTH                     equ 0001h
MD1SRC_MD1MS0_MASK                       equ 0001h
MD1SRC_MD1MS1_POSN                       equ 0001h
MD1SRC_MD1MS1_POSITION                   equ 0001h
MD1SRC_MD1MS1_SIZE                       equ 0001h
MD1SRC_MD1MS1_LENGTH                     equ 0001h
MD1SRC_MD1MS1_MASK                       equ 0002h
MD1SRC_MD1MS2_POSN                       equ 0002h
MD1SRC_MD1MS2_POSITION                   equ 0002h
MD1SRC_MD1MS2_SIZE                       equ 0001h
MD1SRC_MD1MS2_LENGTH                     equ 0001h
MD1SRC_MD1MS2_MASK                       equ 0004h
MD1SRC_MD1MS3_POSN                       equ 0003h
MD1SRC_MD1MS3_POSITION                   equ 0003h
MD1SRC_MD1MS3_SIZE                       equ 0001h
MD1SRC_MD1MS3_LENGTH                     equ 0001h
MD1SRC_MD1MS3_MASK                       equ 0008h
MD1SRC_MD1MS4_POSN                       equ 0004h
MD1SRC_MD1MS4_POSITION                   equ 0004h
MD1SRC_MD1MS4_SIZE                       equ 0001h
MD1SRC_MD1MS4_LENGTH                     equ 0001h
MD1SRC_MD1MS4_MASK                       equ 0010h
MD1SRC_MD1MS5_POSN                       equ 0005h
MD1SRC_MD1MS5_POSITION                   equ 0005h
MD1SRC_MD1MS5_SIZE                       equ 0001h
MD1SRC_MD1MS5_LENGTH                     equ 0001h
MD1SRC_MD1MS5_MASK                       equ 0020h

// Register: MD1CARL
#define MD1CARL MD1CARL
MD1CARL                                  equ 006Dh
// bitfield definitions
MD1CARL_CL_POSN                          equ 0000h
MD1CARL_CL_POSITION                      equ 0000h
MD1CARL_CL_SIZE                          equ 0008h
MD1CARL_CL_LENGTH                        equ 0008h
MD1CARL_CL_MASK                          equ 00FFh
MD1CARL_CL0_POSN                         equ 0000h
MD1CARL_CL0_POSITION                     equ 0000h
MD1CARL_CL0_SIZE                         equ 0001h
MD1CARL_CL0_LENGTH                       equ 0001h
MD1CARL_CL0_MASK                         equ 0001h
MD1CARL_CL1_POSN                         equ 0001h
MD1CARL_CL1_POSITION                     equ 0001h
MD1CARL_CL1_SIZE                         equ 0001h
MD1CARL_CL1_LENGTH                       equ 0001h
MD1CARL_CL1_MASK                         equ 0002h
MD1CARL_CL2_POSN                         equ 0002h
MD1CARL_CL2_POSITION                     equ 0002h
MD1CARL_CL2_SIZE                         equ 0001h
MD1CARL_CL2_LENGTH                       equ 0001h
MD1CARL_CL2_MASK                         equ 0004h
MD1CARL_CL3_POSN                         equ 0003h
MD1CARL_CL3_POSITION                     equ 0003h
MD1CARL_CL3_SIZE                         equ 0001h
MD1CARL_CL3_LENGTH                       equ 0001h
MD1CARL_CL3_MASK                         equ 0008h
MD1CARL_CL4_POSN                         equ 0004h
MD1CARL_CL4_POSITION                     equ 0004h
MD1CARL_CL4_SIZE                         equ 0001h
MD1CARL_CL4_LENGTH                       equ 0001h
MD1CARL_CL4_MASK                         equ 0010h
MD1CARL_MD1CL_POSN                       equ 0000h
MD1CARL_MD1CL_POSITION                   equ 0000h
MD1CARL_MD1CL_SIZE                       equ 0008h
MD1CARL_MD1CL_LENGTH                     equ 0008h
MD1CARL_MD1CL_MASK                       equ 00FFh
MD1CARL_MD1CL0_POSN                      equ 0000h
MD1CARL_MD1CL0_POSITION                  equ 0000h
MD1CARL_MD1CL0_SIZE                      equ 0001h
MD1CARL_MD1CL0_LENGTH                    equ 0001h
MD1CARL_MD1CL0_MASK                      equ 0001h
MD1CARL_MD1CL1_POSN                      equ 0001h
MD1CARL_MD1CL1_POSITION                  equ 0001h
MD1CARL_MD1CL1_SIZE                      equ 0001h
MD1CARL_MD1CL1_LENGTH                    equ 0001h
MD1CARL_MD1CL1_MASK                      equ 0002h
MD1CARL_MD1CL2_POSN                      equ 0002h
MD1CARL_MD1CL2_POSITION                  equ 0002h
MD1CARL_MD1CL2_SIZE                      equ 0001h
MD1CARL_MD1CL2_LENGTH                    equ 0001h
MD1CARL_MD1CL2_MASK                      equ 0004h
MD1CARL_MD1CL3_POSN                      equ 0003h
MD1CARL_MD1CL3_POSITION                  equ 0003h
MD1CARL_MD1CL3_SIZE                      equ 0001h
MD1CARL_MD1CL3_LENGTH                    equ 0001h
MD1CARL_MD1CL3_MASK                      equ 0008h
MD1CARL_MD1CL4_POSN                      equ 0004h
MD1CARL_MD1CL4_POSITION                  equ 0004h
MD1CARL_MD1CL4_SIZE                      equ 0001h
MD1CARL_MD1CL4_LENGTH                    equ 0001h
MD1CARL_MD1CL4_MASK                      equ 0010h

// Register: MD1CARH
#define MD1CARH MD1CARH
MD1CARH                                  equ 006Eh
// bitfield definitions
MD1CARH_CH_POSN                          equ 0000h
MD1CARH_CH_POSITION                      equ 0000h
MD1CARH_CH_SIZE                          equ 0008h
MD1CARH_CH_LENGTH                        equ 0008h
MD1CARH_CH_MASK                          equ 00FFh
MD1CARH_CH0_POSN                         equ 0000h
MD1CARH_CH0_POSITION                     equ 0000h
MD1CARH_CH0_SIZE                         equ 0001h
MD1CARH_CH0_LENGTH                       equ 0001h
MD1CARH_CH0_MASK                         equ 0001h
MD1CARH_CH1_POSN                         equ 0001h
MD1CARH_CH1_POSITION                     equ 0001h
MD1CARH_CH1_SIZE                         equ 0001h
MD1CARH_CH1_LENGTH                       equ 0001h
MD1CARH_CH1_MASK                         equ 0002h
MD1CARH_CH2_POSN                         equ 0002h
MD1CARH_CH2_POSITION                     equ 0002h
MD1CARH_CH2_SIZE                         equ 0001h
MD1CARH_CH2_LENGTH                       equ 0001h
MD1CARH_CH2_MASK                         equ 0004h
MD1CARH_CH3_POSN                         equ 0003h
MD1CARH_CH3_POSITION                     equ 0003h
MD1CARH_CH3_SIZE                         equ 0001h
MD1CARH_CH3_LENGTH                       equ 0001h
MD1CARH_CH3_MASK                         equ 0008h
MD1CARH_CH4_POSN                         equ 0004h
MD1CARH_CH4_POSITION                     equ 0004h
MD1CARH_CH4_SIZE                         equ 0001h
MD1CARH_CH4_LENGTH                       equ 0001h
MD1CARH_CH4_MASK                         equ 0010h
MD1CARH_MD1CH_POSN                       equ 0000h
MD1CARH_MD1CH_POSITION                   equ 0000h
MD1CARH_MD1CH_SIZE                       equ 0008h
MD1CARH_MD1CH_LENGTH                     equ 0008h
MD1CARH_MD1CH_MASK                       equ 00FFh
MD1CARH_MD1CH0_POSN                      equ 0000h
MD1CARH_MD1CH0_POSITION                  equ 0000h
MD1CARH_MD1CH0_SIZE                      equ 0001h
MD1CARH_MD1CH0_LENGTH                    equ 0001h
MD1CARH_MD1CH0_MASK                      equ 0001h
MD1CARH_MD1CH1_POSN                      equ 0001h
MD1CARH_MD1CH1_POSITION                  equ 0001h
MD1CARH_MD1CH1_SIZE                      equ 0001h
MD1CARH_MD1CH1_LENGTH                    equ 0001h
MD1CARH_MD1CH1_MASK                      equ 0002h
MD1CARH_MD1CH2_POSN                      equ 0002h
MD1CARH_MD1CH2_POSITION                  equ 0002h
MD1CARH_MD1CH2_SIZE                      equ 0001h
MD1CARH_MD1CH2_LENGTH                    equ 0001h
MD1CARH_MD1CH2_MASK                      equ 0004h
MD1CARH_MD1CH3_POSN                      equ 0003h
MD1CARH_MD1CH3_POSITION                  equ 0003h
MD1CARH_MD1CH3_SIZE                      equ 0001h
MD1CARH_MD1CH3_LENGTH                    equ 0001h
MD1CARH_MD1CH3_MASK                      equ 0008h
MD1CARH_MD1CH4_POSN                      equ 0004h
MD1CARH_MD1CH4_POSITION                  equ 0004h
MD1CARH_MD1CH4_SIZE                      equ 0001h
MD1CARH_MD1CH4_LENGTH                    equ 0001h
MD1CARH_MD1CH4_MASK                      equ 0010h

// Register: CMOUT
#define CMOUT CMOUT
CMOUT                                    equ 006Fh
// bitfield definitions
CMOUT_MC1OUT_POSN                        equ 0000h
CMOUT_MC1OUT_POSITION                    equ 0000h
CMOUT_MC1OUT_SIZE                        equ 0001h
CMOUT_MC1OUT_LENGTH                      equ 0001h
CMOUT_MC1OUT_MASK                        equ 0001h
CMOUT_MC2OUT_POSN                        equ 0001h
CMOUT_MC2OUT_POSITION                    equ 0001h
CMOUT_MC2OUT_SIZE                        equ 0001h
CMOUT_MC2OUT_LENGTH                      equ 0001h
CMOUT_MC2OUT_MASK                        equ 0002h

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 0070h
// bitfield definitions
CM1CON0_SYNC_POSN                        equ 0000h
CM1CON0_SYNC_POSITION                    equ 0000h
CM1CON0_SYNC_SIZE                        equ 0001h
CM1CON0_SYNC_LENGTH                      equ 0001h
CM1CON0_SYNC_MASK                        equ 0001h
CM1CON0_HYS_POSN                         equ 0001h
CM1CON0_HYS_POSITION                     equ 0001h
CM1CON0_HYS_SIZE                         equ 0001h
CM1CON0_HYS_LENGTH                       equ 0001h
CM1CON0_HYS_MASK                         equ 0002h
CM1CON0_POL_POSN                         equ 0004h
CM1CON0_POL_POSITION                     equ 0004h
CM1CON0_POL_SIZE                         equ 0001h
CM1CON0_POL_LENGTH                       equ 0001h
CM1CON0_POL_MASK                         equ 0010h
CM1CON0_OUT_POSN                         equ 0006h
CM1CON0_OUT_POSITION                     equ 0006h
CM1CON0_OUT_SIZE                         equ 0001h
CM1CON0_OUT_LENGTH                       equ 0001h
CM1CON0_OUT_MASK                         equ 0040h
CM1CON0_EN_POSN                          equ 0007h
CM1CON0_EN_POSITION                      equ 0007h
CM1CON0_EN_SIZE                          equ 0001h
CM1CON0_EN_LENGTH                        equ 0001h
CM1CON0_EN_MASK                          equ 0080h
CM1CON0_C1SYNC_POSN                      equ 0000h
CM1CON0_C1SYNC_POSITION                  equ 0000h
CM1CON0_C1SYNC_SIZE                      equ 0001h
CM1CON0_C1SYNC_LENGTH                    equ 0001h
CM1CON0_C1SYNC_MASK                      equ 0001h
CM1CON0_C1HYS_POSN                       equ 0001h
CM1CON0_C1HYS_POSITION                   equ 0001h
CM1CON0_C1HYS_SIZE                       equ 0001h
CM1CON0_C1HYS_LENGTH                     equ 0001h
CM1CON0_C1HYS_MASK                       equ 0002h
CM1CON0_C1POL_POSN                       equ 0004h
CM1CON0_C1POL_POSITION                   equ 0004h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0010h
CM1CON0_C1OUT_POSN                       equ 0006h
CM1CON0_C1OUT_POSITION                   equ 0006h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0040h
CM1CON0_C1EN_POSN                        equ 0007h
CM1CON0_C1EN_POSITION                    equ 0007h
CM1CON0_C1EN_SIZE                        equ 0001h
CM1CON0_C1EN_LENGTH                      equ 0001h
CM1CON0_C1EN_MASK                        equ 0080h

// Register: CM1CON1
#define CM1CON1 CM1CON1
CM1CON1                                  equ 0071h
// bitfield definitions
CM1CON1_INTN_POSN                        equ 0000h
CM1CON1_INTN_POSITION                    equ 0000h
CM1CON1_INTN_SIZE                        equ 0001h
CM1CON1_INTN_LENGTH                      equ 0001h
CM1CON1_INTN_MASK                        equ 0001h
CM1CON1_INTP_POSN                        equ 0001h
CM1CON1_INTP_POSITION                    equ 0001h
CM1CON1_INTP_SIZE                        equ 0001h
CM1CON1_INTP_LENGTH                      equ 0001h
CM1CON1_INTP_MASK                        equ 0002h
CM1CON1_C1INTN_POSN                      equ 0000h
CM1CON1_C1INTN_POSITION                  equ 0000h
CM1CON1_C1INTN_SIZE                      equ 0001h
CM1CON1_C1INTN_LENGTH                    equ 0001h
CM1CON1_C1INTN_MASK                      equ 0001h
CM1CON1_C1INTP_POSN                      equ 0001h
CM1CON1_C1INTP_POSITION                  equ 0001h
CM1CON1_C1INTP_SIZE                      equ 0001h
CM1CON1_C1INTP_LENGTH                    equ 0001h
CM1CON1_C1INTP_MASK                      equ 0002h

