GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: C1TEFUAH
#define C1TEFUAH C1TEFUAH
C1TEFUAH                                 equ 0149h
// bitfield definitions
C1TEFUAH_TEFUA_POSN                      equ 0000h
C1TEFUAH_TEFUA_POSITION                  equ 0000h
C1TEFUAH_TEFUA_SIZE                      equ 0008h
C1TEFUAH_TEFUA_LENGTH                    equ 0008h
C1TEFUAH_TEFUA_MASK                      equ 00FFh
C1TEFUAH_TEFUA8_POSN                     equ 0000h
C1TEFUAH_TEFUA8_POSITION                 equ 0000h
C1TEFUAH_TEFUA8_SIZE                     equ 0001h
C1TEFUAH_TEFUA8_LENGTH                   equ 0001h
C1TEFUAH_TEFUA8_MASK                     equ 0001h
C1TEFUAH_TEFUA9_POSN                     equ 0001h
C1TEFUAH_TEFUA9_POSITION                 equ 0001h
C1TEFUAH_TEFUA9_SIZE                     equ 0001h
C1TEFUAH_TEFUA9_LENGTH                   equ 0001h
C1TEFUAH_TEFUA9_MASK                     equ 0002h
C1TEFUAH_TEFUA10_POSN                    equ 0002h
C1TEFUAH_TEFUA10_POSITION                equ 0002h
C1TEFUAH_TEFUA10_SIZE                    equ 0001h
C1TEFUAH_TEFUA10_LENGTH                  equ 0001h
C1TEFUAH_TEFUA10_MASK                    equ 0004h
C1TEFUAH_TEFUA11_POSN                    equ 0003h
C1TEFUAH_TEFUA11_POSITION                equ 0003h
C1TEFUAH_TEFUA11_SIZE                    equ 0001h
C1TEFUAH_TEFUA11_LENGTH                  equ 0001h
C1TEFUAH_TEFUA11_MASK                    equ 0008h
C1TEFUAH_TEFUA12_POSN                    equ 0004h
C1TEFUAH_TEFUA12_POSITION                equ 0004h
C1TEFUAH_TEFUA12_SIZE                    equ 0001h
C1TEFUAH_TEFUA12_LENGTH                  equ 0001h
C1TEFUAH_TEFUA12_MASK                    equ 0010h
C1TEFUAH_TEFUA13_POSN                    equ 0005h
C1TEFUAH_TEFUA13_POSITION                equ 0005h
C1TEFUAH_TEFUA13_SIZE                    equ 0001h
C1TEFUAH_TEFUA13_LENGTH                  equ 0001h
C1TEFUAH_TEFUA13_MASK                    equ 0020h
C1TEFUAH_TEFUA14_POSN                    equ 0006h
C1TEFUAH_TEFUA14_POSITION                equ 0006h
C1TEFUAH_TEFUA14_SIZE                    equ 0001h
C1TEFUAH_TEFUA14_LENGTH                  equ 0001h
C1TEFUAH_TEFUA14_MASK                    equ 0040h
C1TEFUAH_TEFUA15_POSN                    equ 0007h
C1TEFUAH_TEFUA15_POSITION                equ 0007h
C1TEFUAH_TEFUA15_SIZE                    equ 0001h
C1TEFUAH_TEFUA15_LENGTH                  equ 0001h
C1TEFUAH_TEFUA15_MASK                    equ 0080h

// Register: C1TEFUAU
#define C1TEFUAU C1TEFUAU
C1TEFUAU                                 equ 014Ah
// bitfield definitions
C1TEFUAU_TEFUA_POSN                      equ 0000h
C1TEFUAU_TEFUA_POSITION                  equ 0000h
C1TEFUAU_TEFUA_SIZE                      equ 0008h
C1TEFUAU_TEFUA_LENGTH                    equ 0008h
C1TEFUAU_TEFUA_MASK                      equ 00FFh
C1TEFUAU_TEFUA16_POSN                    equ 0000h
C1TEFUAU_TEFUA16_POSITION                equ 0000h
C1TEFUAU_TEFUA16_SIZE                    equ 0001h
C1TEFUAU_TEFUA16_LENGTH                  equ 0001h
C1TEFUAU_TEFUA16_MASK                    equ 0001h
C1TEFUAU_TEFUA17_POSN                    equ 0001h
C1TEFUAU_TEFUA17_POSITION                equ 0001h
C1TEFUAU_TEFUA17_SIZE                    equ 0001h
C1TEFUAU_TEFUA17_LENGTH                  equ 0001h
C1TEFUAU_TEFUA17_MASK                    equ 0002h
C1TEFUAU_TEFUA18_POSN                    equ 0002h
C1TEFUAU_TEFUA18_POSITION                equ 0002h
C1TEFUAU_TEFUA18_SIZE                    equ 0001h
C1TEFUAU_TEFUA18_LENGTH                  equ 0001h
C1TEFUAU_TEFUA18_MASK                    equ 0004h
C1TEFUAU_TEFUA19_POSN                    equ 0003h
C1TEFUAU_TEFUA19_POSITION                equ 0003h
C1TEFUAU_TEFUA19_SIZE                    equ 0001h
C1TEFUAU_TEFUA19_LENGTH                  equ 0001h
C1TEFUAU_TEFUA19_MASK                    equ 0008h
C1TEFUAU_TEFUA20_POSN                    equ 0004h
C1TEFUAU_TEFUA20_POSITION                equ 0004h
C1TEFUAU_TEFUA20_SIZE                    equ 0001h
C1TEFUAU_TEFUA20_LENGTH                  equ 0001h
C1TEFUAU_TEFUA20_MASK                    equ 0010h
C1TEFUAU_TEFUA21_POSN                    equ 0005h
C1TEFUAU_TEFUA21_POSITION                equ 0005h
C1TEFUAU_TEFUA21_SIZE                    equ 0001h
C1TEFUAU_TEFUA21_LENGTH                  equ 0001h
C1TEFUAU_TEFUA21_MASK                    equ 0020h
C1TEFUAU_TEFUA22_POSN                    equ 0006h
C1TEFUAU_TEFUA22_POSITION                equ 0006h
C1TEFUAU_TEFUA22_SIZE                    equ 0001h
C1TEFUAU_TEFUA22_LENGTH                  equ 0001h
C1TEFUAU_TEFUA22_MASK                    equ 0040h
C1TEFUAU_TEFUA23_POSN                    equ 0007h
C1TEFUAU_TEFUA23_POSITION                equ 0007h
C1TEFUAU_TEFUA23_SIZE                    equ 0001h
C1TEFUAU_TEFUA23_LENGTH                  equ 0001h
C1TEFUAU_TEFUA23_MASK                    equ 0080h

// Register: C1TEFUAT
#define C1TEFUAT C1TEFUAT
C1TEFUAT                                 equ 014Bh
// bitfield definitions
C1TEFUAT_TEFUA_POSN                      equ 0000h
C1TEFUAT_TEFUA_POSITION                  equ 0000h
C1TEFUAT_TEFUA_SIZE                      equ 0008h
C1TEFUAT_TEFUA_LENGTH                    equ 0008h
C1TEFUAT_TEFUA_MASK                      equ 00FFh
C1TEFUAT_TEFUA24_POSN                    equ 0000h
C1TEFUAT_TEFUA24_POSITION                equ 0000h
C1TEFUAT_TEFUA24_SIZE                    equ 0001h
C1TEFUAT_TEFUA24_LENGTH                  equ 0001h
C1TEFUAT_TEFUA24_MASK                    equ 0001h
C1TEFUAT_TEFUA25_POSN                    equ 0001h
C1TEFUAT_TEFUA25_POSITION                equ 0001h
C1TEFUAT_TEFUA25_SIZE                    equ 0001h
C1TEFUAT_TEFUA25_LENGTH                  equ 0001h
C1TEFUAT_TEFUA25_MASK                    equ 0002h
C1TEFUAT_TEFUA26_POSN                    equ 0002h
C1TEFUAT_TEFUA26_POSITION                equ 0002h
C1TEFUAT_TEFUA26_SIZE                    equ 0001h
C1TEFUAT_TEFUA26_LENGTH                  equ 0001h
C1TEFUAT_TEFUA26_MASK                    equ 0004h
C1TEFUAT_TEFUA27_POSN                    equ 0003h
C1TEFUAT_TEFUA27_POSITION                equ 0003h
C1TEFUAT_TEFUA27_SIZE                    equ 0001h
C1TEFUAT_TEFUA27_LENGTH                  equ 0001h
C1TEFUAT_TEFUA27_MASK                    equ 0008h
C1TEFUAT_TEFUA28_POSN                    equ 0004h
C1TEFUAT_TEFUA28_POSITION                equ 0004h
C1TEFUAT_TEFUA28_SIZE                    equ 0001h
C1TEFUAT_TEFUA28_LENGTH                  equ 0001h
C1TEFUAT_TEFUA28_MASK                    equ 0010h
C1TEFUAT_TEFUA29_POSN                    equ 0005h
C1TEFUAT_TEFUA29_POSITION                equ 0005h
C1TEFUAT_TEFUA29_SIZE                    equ 0001h
C1TEFUAT_TEFUA29_LENGTH                  equ 0001h
C1TEFUAT_TEFUA29_MASK                    equ 0020h
C1TEFUAT_TEFUA30_POSN                    equ 0006h
C1TEFUAT_TEFUA30_POSITION                equ 0006h
C1TEFUAT_TEFUA30_SIZE                    equ 0001h
C1TEFUAT_TEFUA30_LENGTH                  equ 0001h
C1TEFUAT_TEFUA30_MASK                    equ 0040h
C1TEFUAT_TEFUA31_POSN                    equ 0007h
C1TEFUAT_TEFUA31_POSITION                equ 0007h
C1TEFUAT_TEFUA31_SIZE                    equ 0001h
C1TEFUAT_TEFUA31_LENGTH                  equ 0001h
C1TEFUAT_TEFUA31_MASK                    equ 0080h

