GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: C1FIFOBAT
#define C1FIFOBAT C1FIFOBAT
C1FIFOBAT                                equ 014Fh
// bitfield definitions
C1FIFOBAT_FIFOBA_POSN                    equ 0000h
C1FIFOBAT_FIFOBA_POSITION                equ 0000h
C1FIFOBAT_FIFOBA_SIZE                    equ 0008h
C1FIFOBAT_FIFOBA_LENGTH                  equ 0008h
C1FIFOBAT_FIFOBA_MASK                    equ 00FFh
C1FIFOBAT_FIFOBA24_POSN                  equ 0000h
C1FIFOBAT_FIFOBA24_POSITION              equ 0000h
C1FIFOBAT_FIFOBA24_SIZE                  equ 0001h
C1FIFOBAT_FIFOBA24_LENGTH                equ 0001h
C1FIFOBAT_FIFOBA24_MASK                  equ 0001h
C1FIFOBAT_FIFOBA25_POSN                  equ 0001h
C1FIFOBAT_FIFOBA25_POSITION              equ 0001h
C1FIFOBAT_FIFOBA25_SIZE                  equ 0001h
C1FIFOBAT_FIFOBA25_LENGTH                equ 0001h
C1FIFOBAT_FIFOBA25_MASK                  equ 0002h
C1FIFOBAT_FIFOBA26_POSN                  equ 0002h
C1FIFOBAT_FIFOBA26_POSITION              equ 0002h
C1FIFOBAT_FIFOBA26_SIZE                  equ 0001h
C1FIFOBAT_FIFOBA26_LENGTH                equ 0001h
C1FIFOBAT_FIFOBA26_MASK                  equ 0004h
C1FIFOBAT_FIFOBA27_POSN                  equ 0003h
C1FIFOBAT_FIFOBA27_POSITION              equ 0003h
C1FIFOBAT_FIFOBA27_SIZE                  equ 0001h
C1FIFOBAT_FIFOBA27_LENGTH                equ 0001h
C1FIFOBAT_FIFOBA27_MASK                  equ 0008h
C1FIFOBAT_FIFOBA28_POSN                  equ 0004h
C1FIFOBAT_FIFOBA28_POSITION              equ 0004h
C1FIFOBAT_FIFOBA28_SIZE                  equ 0001h
C1FIFOBAT_FIFOBA28_LENGTH                equ 0001h
C1FIFOBAT_FIFOBA28_MASK                  equ 0010h
C1FIFOBAT_FIFOBA29_POSN                  equ 0005h
C1FIFOBAT_FIFOBA29_POSITION              equ 0005h
C1FIFOBAT_FIFOBA29_SIZE                  equ 0001h
C1FIFOBAT_FIFOBA29_LENGTH                equ 0001h
C1FIFOBAT_FIFOBA29_MASK                  equ 0020h
C1FIFOBAT_FIFOBA30_POSN                  equ 0006h
C1FIFOBAT_FIFOBA30_POSITION              equ 0006h
C1FIFOBAT_FIFOBA30_SIZE                  equ 0001h
C1FIFOBAT_FIFOBA30_LENGTH                equ 0001h
C1FIFOBAT_FIFOBA30_MASK                  equ 0040h
C1FIFOBAT_FIFOBA31_POSN                  equ 0007h
C1FIFOBAT_FIFOBA31_POSITION              equ 0007h
C1FIFOBAT_FIFOBA31_SIZE                  equ 0001h
C1FIFOBAT_FIFOBA31_LENGTH                equ 0001h
C1FIFOBAT_FIFOBA31_MASK                  equ 0080h

// Register: C1TXQCONL
#define C1TXQCONL C1TXQCONL
C1TXQCONL                                equ 0150h
// bitfield definitions
C1TXQCONL_TXQNIE_POSN                    equ 0000h
C1TXQCONL_TXQNIE_POSITION                equ 0000h
C1TXQCONL_TXQNIE_SIZE                    equ 0001h
C1TXQCONL_TXQNIE_LENGTH                  equ 0001h
C1TXQCONL_TXQNIE_MASK                    equ 0001h
C1TXQCONL_TXQEIE_POSN                    equ 0002h
C1TXQCONL_TXQEIE_POSITION                equ 0002h
C1TXQCONL_TXQEIE_SIZE                    equ 0001h
C1TXQCONL_TXQEIE_LENGTH                  equ 0001h
C1TXQCONL_TXQEIE_MASK                    equ 0004h
C1TXQCONL_TXATIE_POSN                    equ 0004h
C1TXQCONL_TXATIE_POSITION                equ 0004h
C1TXQCONL_TXATIE_SIZE                    equ 0001h
C1TXQCONL_TXATIE_LENGTH                  equ 0001h
C1TXQCONL_TXATIE_MASK                    equ 0010h
C1TXQCONL_TXEN_POSN                      equ 0007h
C1TXQCONL_TXEN_POSITION                  equ 0007h
C1TXQCONL_TXEN_SIZE                      equ 0001h
C1TXQCONL_TXEN_LENGTH                    equ 0001h
C1TXQCONL_TXEN_MASK                      equ 0080h

// Register: C1TXQCONH
#define C1TXQCONH C1TXQCONH
C1TXQCONH                                equ 0151h
// bitfield definitions
C1TXQCONH_UINC_POSN                      equ 0000h
C1TXQCONH_UINC_POSITION                  equ 0000h
C1TXQCONH_UINC_SIZE                      equ 0001h
C1TXQCONH_UINC_LENGTH                    equ 0001h
C1TXQCONH_UINC_MASK                      equ 0001h
C1TXQCONH_TXREQ_POSN                     equ 0001h
C1TXQCONH_TXREQ_POSITION                 equ 0001h
C1TXQCONH_TXREQ_SIZE                     equ 0001h
C1TXQCONH_TXREQ_LENGTH                   equ 0001h
C1TXQCONH_TXREQ_MASK                     equ 0002h
C1TXQCONH_FRESET_POSN                    equ 0002h
C1TXQCONH_FRESET_POSITION                equ 0002h
C1TXQCONH_FRESET_SIZE                    equ 0001h
C1TXQCONH_FRESET_LENGTH                  equ 0001h
C1TXQCONH_FRESET_MASK                    equ 0004h

// Register: C1TXQCONU
#define C1TXQCONU C1TXQCONU
C1TXQCONU                                equ 0152h
// bitfield definitions
C1TXQCONU_TXPRI_POSN                     equ 0000h
C1TXQCONU_TXPRI_POSITION                 equ 0000h
C1TXQCONU_TXPRI_SIZE                     equ 0005h
C1TXQCONU_TXPRI_LENGTH                   equ 0005h
C1TXQCONU_TXPRI_MASK                     equ 001Fh
C1TXQCONU_TXAT_POSN                      equ 0005h
C1TXQCONU_TXAT_POSITION                  equ 0005h
C1TXQCONU_TXAT_SIZE                      equ 0002h
C1TXQCONU_TXAT_LENGTH                    equ 0002h
C1TXQCONU_TXAT_MASK                      equ 0060h
C1TXQCONU_TXPRI0_POSN                    equ 0000h
C1TXQCONU_TXPRI0_POSITION                equ 0000h
C1TXQCONU_TXPRI0_SIZE                    equ 0001h
C1TXQCONU_TXPRI0_LENGTH                  equ 0001h
C1TXQCONU_TXPRI0_MASK                    equ 0001h
C1TXQCONU_TXPRI1_POSN                    equ 0001h
C1TXQCONU_TXPRI1_POSITION                equ 0001h
C1TXQCONU_TXPRI1_SIZE                    equ 0001h
C1TXQCONU_TXPRI1_LENGTH                  equ 0001h
C1TXQCONU_TXPRI1_MASK                    equ 0002h
C1TXQCONU_TXPRI2_POSN                    equ 0002h
C1TXQCONU_TXPRI2_POSITION                equ 0002h
C1TXQCONU_TXPRI2_SIZE                    equ 0001h
C1TXQCONU_TXPRI2_LENGTH                  equ 0001h
C1TXQCONU_TXPRI2_MASK                    equ 0004h
C1TXQCONU_TXPRI3_POSN                    equ 0003h
C1TXQCONU_TXPRI3_POSITION                equ 0003h
C1TXQCONU_TXPRI3_SIZE                    equ 0001h
C1TXQCONU_TXPRI3_LENGTH                  equ 0001h
C1TXQCONU_TXPRI3_MASK                    equ 0008h
C1TXQCONU_TXPRI4_POSN                    equ 0004h
C1TXQCONU_TXPRI4_POSITION                equ 0004h
C1TXQCONU_TXPRI4_SIZE                    equ 0001h
C1TXQCONU_TXPRI4_LENGTH                  equ 0001h
C1TXQCONU_TXPRI4_MASK                    equ 0010h
C1TXQCONU_TXAT0_POSN                     equ 0005h
C1TXQCONU_TXAT0_POSITION                 equ 0005h
C1TXQCONU_TXAT0_SIZE                     equ 0001h
C1TXQCONU_TXAT0_LENGTH                   equ 0001h
C1TXQCONU_TXAT0_MASK                     equ 0020h
C1TXQCONU_TXAT1_POSN                     equ 0006h
C1TXQCONU_TXAT1_POSITION                 equ 0006h
C1TXQCONU_TXAT1_SIZE                     equ 0001h
C1TXQCONU_TXAT1_LENGTH                   equ 0001h
C1TXQCONU_TXAT1_MASK                     equ 0040h

// Register: C1TXQCONT
#define C1TXQCONT C1TXQCONT
C1TXQCONT                                equ 0153h
// bitfield definitions
C1TXQCONT_FSIZE_POSN                     equ 0000h
C1TXQCONT_FSIZE_POSITION                 equ 0000h
C1TXQCONT_FSIZE_SIZE                     equ 0005h
C1TXQCONT_FSIZE_LENGTH                   equ 0005h
C1TXQCONT_FSIZE_MASK                     equ 001Fh
C1TXQCONT_FSIZE0_POSN                    equ 0000h
C1TXQCONT_FSIZE0_POSITION                equ 0000h
C1TXQCONT_FSIZE0_SIZE                    equ 0001h
C1TXQCONT_FSIZE0_LENGTH                  equ 0001h
C1TXQCONT_FSIZE0_MASK                    equ 0001h
C1TXQCONT_FSIZE1_POSN                    equ 0001h
C1TXQCONT_FSIZE1_POSITION                equ 0001h
C1TXQCONT_FSIZE1_SIZE                    equ 0001h
C1TXQCONT_FSIZE1_LENGTH                  equ 0001h
C1TXQCONT_FSIZE1_MASK                    equ 0002h
C1TXQCONT_FSIZE2_POSN                    equ 0002h
C1TXQCONT_FSIZE2_POSITION                equ 0002h
C1TXQCONT_FSIZE2_SIZE                    equ 0001h
C1TXQCONT_FSIZE2_LENGTH                  equ 0001h
C1TXQCONT_FSIZE2_MASK                    equ 0004h
C1TXQCONT_FSIZE3_POSN                    equ 0003h
C1TXQCONT_FSIZE3_POSITION                equ 0003h
C1TXQCONT_FSIZE3_SIZE                    equ 0001h
C1TXQCONT_FSIZE3_LENGTH                  equ 0001h
C1TXQCONT_FSIZE3_MASK                    equ 0008h
C1TXQCONT_FSIZE4_POSN                    equ 0004h
C1TXQCONT_FSIZE4_POSITION                equ 0004h
C1TXQCONT_FSIZE4_SIZE                    equ 0001h
C1TXQCONT_FSIZE4_LENGTH                  equ 0001h
C1TXQCONT_FSIZE4_MASK                    equ 0010h

