GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: C1MASK7H
#define C1MASK7H C1MASK7H
C1MASK7H                                 equ 01C9h
// bitfield definitions
C1MASK7H_MSID_POSN                       equ 0000h
C1MASK7H_MSID_POSITION                   equ 0000h
C1MASK7H_MSID_SIZE                       equ 0003h
C1MASK7H_MSID_LENGTH                     equ 0003h
C1MASK7H_MSID_MASK                       equ 0007h
C1MASK7H_MEID_POSN                       equ 0003h
C1MASK7H_MEID_POSITION                   equ 0003h
C1MASK7H_MEID_SIZE                       equ 0005h
C1MASK7H_MEID_LENGTH                     equ 0005h
C1MASK7H_MEID_MASK                       equ 00F8h
C1MASK7H_MSID8_POSN                      equ 0000h
C1MASK7H_MSID8_POSITION                  equ 0000h
C1MASK7H_MSID8_SIZE                      equ 0001h
C1MASK7H_MSID8_LENGTH                    equ 0001h
C1MASK7H_MSID8_MASK                      equ 0001h
C1MASK7H_MSID9_POSN                      equ 0001h
C1MASK7H_MSID9_POSITION                  equ 0001h
C1MASK7H_MSID9_SIZE                      equ 0001h
C1MASK7H_MSID9_LENGTH                    equ 0001h
C1MASK7H_MSID9_MASK                      equ 0002h
C1MASK7H_MSID10_POSN                     equ 0002h
C1MASK7H_MSID10_POSITION                 equ 0002h
C1MASK7H_MSID10_SIZE                     equ 0001h
C1MASK7H_MSID10_LENGTH                   equ 0001h
C1MASK7H_MSID10_MASK                     equ 0004h
C1MASK7H_MEID0_POSN                      equ 0003h
C1MASK7H_MEID0_POSITION                  equ 0003h
C1MASK7H_MEID0_SIZE                      equ 0001h
C1MASK7H_MEID0_LENGTH                    equ 0001h
C1MASK7H_MEID0_MASK                      equ 0008h
C1MASK7H_MEID1_POSN                      equ 0004h
C1MASK7H_MEID1_POSITION                  equ 0004h
C1MASK7H_MEID1_SIZE                      equ 0001h
C1MASK7H_MEID1_LENGTH                    equ 0001h
C1MASK7H_MEID1_MASK                      equ 0010h
C1MASK7H_MEID2_POSN                      equ 0005h
C1MASK7H_MEID2_POSITION                  equ 0005h
C1MASK7H_MEID2_SIZE                      equ 0001h
C1MASK7H_MEID2_LENGTH                    equ 0001h
C1MASK7H_MEID2_MASK                      equ 0020h
C1MASK7H_MEID3_POSN                      equ 0006h
C1MASK7H_MEID3_POSITION                  equ 0006h
C1MASK7H_MEID3_SIZE                      equ 0001h
C1MASK7H_MEID3_LENGTH                    equ 0001h
C1MASK7H_MEID3_MASK                      equ 0040h
C1MASK7H_MEID4_POSN                      equ 0007h
C1MASK7H_MEID4_POSITION                  equ 0007h
C1MASK7H_MEID4_SIZE                      equ 0001h
C1MASK7H_MEID4_LENGTH                    equ 0001h
C1MASK7H_MEID4_MASK                      equ 0080h

// Register: C1MASK7U
#define C1MASK7U C1MASK7U
C1MASK7U                                 equ 01CAh
// bitfield definitions
C1MASK7U_MEID_POSN                       equ 0000h
C1MASK7U_MEID_POSITION                   equ 0000h
C1MASK7U_MEID_SIZE                       equ 0008h
C1MASK7U_MEID_LENGTH                     equ 0008h
C1MASK7U_MEID_MASK                       equ 00FFh
C1MASK7U_MEID5_POSN                      equ 0000h
C1MASK7U_MEID5_POSITION                  equ 0000h
C1MASK7U_MEID5_SIZE                      equ 0001h
C1MASK7U_MEID5_LENGTH                    equ 0001h
C1MASK7U_MEID5_MASK                      equ 0001h
C1MASK7U_MEID6_POSN                      equ 0001h
C1MASK7U_MEID6_POSITION                  equ 0001h
C1MASK7U_MEID6_SIZE                      equ 0001h
C1MASK7U_MEID6_LENGTH                    equ 0001h
C1MASK7U_MEID6_MASK                      equ 0002h
C1MASK7U_MEID7_POSN                      equ 0002h
C1MASK7U_MEID7_POSITION                  equ 0002h
C1MASK7U_MEID7_SIZE                      equ 0001h
C1MASK7U_MEID7_LENGTH                    equ 0001h
C1MASK7U_MEID7_MASK                      equ 0004h
C1MASK7U_MEID8_POSN                      equ 0003h
C1MASK7U_MEID8_POSITION                  equ 0003h
C1MASK7U_MEID8_SIZE                      equ 0001h
C1MASK7U_MEID8_LENGTH                    equ 0001h
C1MASK7U_MEID8_MASK                      equ 0008h
C1MASK7U_MEID9_POSN                      equ 0004h
C1MASK7U_MEID9_POSITION                  equ 0004h
C1MASK7U_MEID9_SIZE                      equ 0001h
C1MASK7U_MEID9_LENGTH                    equ 0001h
C1MASK7U_MEID9_MASK                      equ 0010h
C1MASK7U_MEID10_POSN                     equ 0005h
C1MASK7U_MEID10_POSITION                 equ 0005h
C1MASK7U_MEID10_SIZE                     equ 0001h
C1MASK7U_MEID10_LENGTH                   equ 0001h
C1MASK7U_MEID10_MASK                     equ 0020h
C1MASK7U_MEID11_POSN                     equ 0006h
C1MASK7U_MEID11_POSITION                 equ 0006h
C1MASK7U_MEID11_SIZE                     equ 0001h
C1MASK7U_MEID11_LENGTH                   equ 0001h
C1MASK7U_MEID11_MASK                     equ 0040h
C1MASK7U_MEID12_POSN                     equ 0007h
C1MASK7U_MEID12_POSITION                 equ 0007h
C1MASK7U_MEID12_SIZE                     equ 0001h
C1MASK7U_MEID12_LENGTH                   equ 0001h
C1MASK7U_MEID12_MASK                     equ 0080h

// Register: C1MASK7T
#define C1MASK7T C1MASK7T
C1MASK7T                                 equ 01CBh
// bitfield definitions
C1MASK7T_MEID_POSN                       equ 0000h
C1MASK7T_MEID_POSITION                   equ 0000h
C1MASK7T_MEID_SIZE                       equ 0005h
C1MASK7T_MEID_LENGTH                     equ 0005h
C1MASK7T_MEID_MASK                       equ 001Fh
C1MASK7T_MSID11_POSN                     equ 0005h
C1MASK7T_MSID11_POSITION                 equ 0005h
C1MASK7T_MSID11_SIZE                     equ 0001h
C1MASK7T_MSID11_LENGTH                   equ 0001h
C1MASK7T_MSID11_MASK                     equ 0020h
C1MASK7T_MIDE_POSN                       equ 0006h
C1MASK7T_MIDE_POSITION                   equ 0006h
C1MASK7T_MIDE_SIZE                       equ 0001h
C1MASK7T_MIDE_LENGTH                     equ 0001h
C1MASK7T_MIDE_MASK                       equ 0040h
C1MASK7T_MEID13_POSN                     equ 0000h
C1MASK7T_MEID13_POSITION                 equ 0000h
C1MASK7T_MEID13_SIZE                     equ 0001h
C1MASK7T_MEID13_LENGTH                   equ 0001h
C1MASK7T_MEID13_MASK                     equ 0001h
C1MASK7T_MEID14_POSN                     equ 0001h
C1MASK7T_MEID14_POSITION                 equ 0001h
C1MASK7T_MEID14_SIZE                     equ 0001h
C1MASK7T_MEID14_LENGTH                   equ 0001h
C1MASK7T_MEID14_MASK                     equ 0002h
C1MASK7T_MEID15_POSN                     equ 0002h
C1MASK7T_MEID15_POSITION                 equ 0002h
C1MASK7T_MEID15_SIZE                     equ 0001h
C1MASK7T_MEID15_LENGTH                   equ 0001h
C1MASK7T_MEID15_MASK                     equ 0004h
C1MASK7T_MEID16_POSN                     equ 0003h
C1MASK7T_MEID16_POSITION                 equ 0003h
C1MASK7T_MEID16_SIZE                     equ 0001h
C1MASK7T_MEID16_LENGTH                   equ 0001h
C1MASK7T_MEID16_MASK                     equ 0008h
C1MASK7T_MEID17_POSN                     equ 0004h
C1MASK7T_MEID17_POSITION                 equ 0004h
C1MASK7T_MEID17_SIZE                     equ 0001h
C1MASK7T_MEID17_LENGTH                   equ 0001h
C1MASK7T_MEID17_MASK                     equ 0010h

// Register: C1FLTOBJ8
#define C1FLTOBJ8 C1FLTOBJ8
C1FLTOBJ8                                equ 01CCh

