GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: CLCIN6PPS
#define CLCIN6PPS CLCIN6PPS
CLCIN6PPS                                equ 0267h
// bitfield definitions
CLCIN6PPS_PIN_POSN                       equ 0000h
CLCIN6PPS_PIN_POSITION                   equ 0000h
CLCIN6PPS_PIN_SIZE                       equ 0003h
CLCIN6PPS_PIN_LENGTH                     equ 0003h
CLCIN6PPS_PIN_MASK                       equ 0007h
CLCIN6PPS_PORT_POSN                      equ 0003h
CLCIN6PPS_PORT_POSITION                  equ 0003h
CLCIN6PPS_PORT_SIZE                      equ 0002h
CLCIN6PPS_PORT_LENGTH                    equ 0002h
CLCIN6PPS_PORT_MASK                      equ 0018h
CLCIN6PPS_CLCIN6PPS0_POSN                equ 0000h
CLCIN6PPS_CLCIN6PPS0_POSITION            equ 0000h
CLCIN6PPS_CLCIN6PPS0_SIZE                equ 0001h
CLCIN6PPS_CLCIN6PPS0_LENGTH              equ 0001h
CLCIN6PPS_CLCIN6PPS0_MASK                equ 0001h
CLCIN6PPS_CLCIN6PPS1_POSN                equ 0001h
CLCIN6PPS_CLCIN6PPS1_POSITION            equ 0001h
CLCIN6PPS_CLCIN6PPS1_SIZE                equ 0001h
CLCIN6PPS_CLCIN6PPS1_LENGTH              equ 0001h
CLCIN6PPS_CLCIN6PPS1_MASK                equ 0002h
CLCIN6PPS_CLCIN6PPS2_POSN                equ 0002h
CLCIN6PPS_CLCIN6PPS2_POSITION            equ 0002h
CLCIN6PPS_CLCIN6PPS2_SIZE                equ 0001h
CLCIN6PPS_CLCIN6PPS2_LENGTH              equ 0001h
CLCIN6PPS_CLCIN6PPS2_MASK                equ 0004h
CLCIN6PPS_CLCIN6PPS3_POSN                equ 0003h
CLCIN6PPS_CLCIN6PPS3_POSITION            equ 0003h
CLCIN6PPS_CLCIN6PPS3_SIZE                equ 0001h
CLCIN6PPS_CLCIN6PPS3_LENGTH              equ 0001h
CLCIN6PPS_CLCIN6PPS3_MASK                equ 0008h
CLCIN6PPS_CLCIN6PPS4_POSN                equ 0004h
CLCIN6PPS_CLCIN6PPS4_POSITION            equ 0004h
CLCIN6PPS_CLCIN6PPS4_SIZE                equ 0001h
CLCIN6PPS_CLCIN6PPS4_LENGTH              equ 0001h
CLCIN6PPS_CLCIN6PPS4_MASK                equ 0010h
CLCIN6PPS_CLCIN6PPS_POSN                 equ 0000h
CLCIN6PPS_CLCIN6PPS_POSITION             equ 0000h
CLCIN6PPS_CLCIN6PPS_SIZE                 equ 0005h
CLCIN6PPS_CLCIN6PPS_LENGTH               equ 0005h
CLCIN6PPS_CLCIN6PPS_MASK                 equ 001Fh

// Register: CLCIN7PPS
#define CLCIN7PPS CLCIN7PPS
CLCIN7PPS                                equ 0268h
// bitfield definitions
CLCIN7PPS_PIN_POSN                       equ 0000h
CLCIN7PPS_PIN_POSITION                   equ 0000h
CLCIN7PPS_PIN_SIZE                       equ 0003h
CLCIN7PPS_PIN_LENGTH                     equ 0003h
CLCIN7PPS_PIN_MASK                       equ 0007h
CLCIN7PPS_PORT_POSN                      equ 0003h
CLCIN7PPS_PORT_POSITION                  equ 0003h
CLCIN7PPS_PORT_SIZE                      equ 0002h
CLCIN7PPS_PORT_LENGTH                    equ 0002h
CLCIN7PPS_PORT_MASK                      equ 0018h
CLCIN7PPS_CLCIN7PPS0_POSN                equ 0000h
CLCIN7PPS_CLCIN7PPS0_POSITION            equ 0000h
CLCIN7PPS_CLCIN7PPS0_SIZE                equ 0001h
CLCIN7PPS_CLCIN7PPS0_LENGTH              equ 0001h
CLCIN7PPS_CLCIN7PPS0_MASK                equ 0001h
CLCIN7PPS_CLCIN7PPS1_POSN                equ 0001h
CLCIN7PPS_CLCIN7PPS1_POSITION            equ 0001h
CLCIN7PPS_CLCIN7PPS1_SIZE                equ 0001h
CLCIN7PPS_CLCIN7PPS1_LENGTH              equ 0001h
CLCIN7PPS_CLCIN7PPS1_MASK                equ 0002h
CLCIN7PPS_CLCIN7PPS2_POSN                equ 0002h
CLCIN7PPS_CLCIN7PPS2_POSITION            equ 0002h
CLCIN7PPS_CLCIN7PPS2_SIZE                equ 0001h
CLCIN7PPS_CLCIN7PPS2_LENGTH              equ 0001h
CLCIN7PPS_CLCIN7PPS2_MASK                equ 0004h
CLCIN7PPS_CLCIN7PPS3_POSN                equ 0003h
CLCIN7PPS_CLCIN7PPS3_POSITION            equ 0003h
CLCIN7PPS_CLCIN7PPS3_SIZE                equ 0001h
CLCIN7PPS_CLCIN7PPS3_LENGTH              equ 0001h
CLCIN7PPS_CLCIN7PPS3_MASK                equ 0008h
CLCIN7PPS_CLCIN7PPS4_POSN                equ 0004h
CLCIN7PPS_CLCIN7PPS4_POSITION            equ 0004h
CLCIN7PPS_CLCIN7PPS4_SIZE                equ 0001h
CLCIN7PPS_CLCIN7PPS4_LENGTH              equ 0001h
CLCIN7PPS_CLCIN7PPS4_MASK                equ 0010h
CLCIN7PPS_CLCIN7PPS_POSN                 equ 0000h
CLCIN7PPS_CLCIN7PPS_POSITION             equ 0000h
CLCIN7PPS_CLCIN7PPS_SIZE                 equ 0005h
CLCIN7PPS_CLCIN7PPS_LENGTH               equ 0005h
CLCIN7PPS_CLCIN7PPS_MASK                 equ 001Fh

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
ADACTPPS                                 equ 0269h
// bitfield definitions
ADACTPPS_PIN_POSN                        equ 0000h
ADACTPPS_PIN_POSITION                    equ 0000h
ADACTPPS_PIN_SIZE                        equ 0003h
ADACTPPS_PIN_LENGTH                      equ 0003h
ADACTPPS_PIN_MASK                        equ 0007h
ADACTPPS_PORT_POSN                       equ 0003h
ADACTPPS_PORT_POSITION                   equ 0003h
ADACTPPS_PORT_SIZE                       equ 0002h
ADACTPPS_PORT_LENGTH                     equ 0002h
ADACTPPS_PORT_MASK                       equ 0018h
ADACTPPS_ADACTPPS0_POSN                  equ 0000h
ADACTPPS_ADACTPPS0_POSITION              equ 0000h
ADACTPPS_ADACTPPS0_SIZE                  equ 0001h
ADACTPPS_ADACTPPS0_LENGTH                equ 0001h
ADACTPPS_ADACTPPS0_MASK                  equ 0001h
ADACTPPS_ADACTPPS1_POSN                  equ 0001h
ADACTPPS_ADACTPPS1_POSITION              equ 0001h
ADACTPPS_ADACTPPS1_SIZE                  equ 0001h
ADACTPPS_ADACTPPS1_LENGTH                equ 0001h
ADACTPPS_ADACTPPS1_MASK                  equ 0002h
ADACTPPS_ADACTPPS2_POSN                  equ 0002h
ADACTPPS_ADACTPPS2_POSITION              equ 0002h
ADACTPPS_ADACTPPS2_SIZE                  equ 0001h
ADACTPPS_ADACTPPS2_LENGTH                equ 0001h
ADACTPPS_ADACTPPS2_MASK                  equ 0004h
ADACTPPS_ADACTPPS3_POSN                  equ 0003h
ADACTPPS_ADACTPPS3_POSITION              equ 0003h
ADACTPPS_ADACTPPS3_SIZE                  equ 0001h
ADACTPPS_ADACTPPS3_LENGTH                equ 0001h
ADACTPPS_ADACTPPS3_MASK                  equ 0008h
ADACTPPS_ADACTPPS4_POSN                  equ 0004h
ADACTPPS_ADACTPPS4_POSITION              equ 0004h
ADACTPPS_ADACTPPS4_SIZE                  equ 0001h
ADACTPPS_ADACTPPS4_LENGTH                equ 0001h
ADACTPPS_ADACTPPS4_MASK                  equ 0010h
ADACTPPS_ADACTPPS_POSN                   equ 0000h
ADACTPPS_ADACTPPS_POSITION               equ 0000h
ADACTPPS_ADACTPPS_SIZE                   equ 0005h
ADACTPPS_ADACTPPS_LENGTH                 equ 0005h
ADACTPPS_ADACTPPS_MASK                   equ 001Fh

// Register: SPI1SCKPPS
#define SPI1SCKPPS SPI1SCKPPS
SPI1SCKPPS                               equ 026Ah
// bitfield definitions
SPI1SCKPPS_PIN_POSN                      equ 0000h
SPI1SCKPPS_PIN_POSITION                  equ 0000h
SPI1SCKPPS_PIN_SIZE                      equ 0003h
SPI1SCKPPS_PIN_LENGTH                    equ 0003h
SPI1SCKPPS_PIN_MASK                      equ 0007h
SPI1SCKPPS_PORT_POSN                     equ 0003h
SPI1SCKPPS_PORT_POSITION                 equ 0003h
SPI1SCKPPS_PORT_SIZE                     equ 0002h
SPI1SCKPPS_PORT_LENGTH                   equ 0002h
SPI1SCKPPS_PORT_MASK                     equ 0018h
SPI1SCKPPS_SPI1SCKPPS_POSN               equ 0000h
SPI1SCKPPS_SPI1SCKPPS_POSITION           equ 0000h
SPI1SCKPPS_SPI1SCKPPS_SIZE               equ 0005h
SPI1SCKPPS_SPI1SCKPPS_LENGTH             equ 0005h
SPI1SCKPPS_SPI1SCKPPS_MASK               equ 001Fh
SPI1SCKPPS_SPI1SCKPPS0_POSN              equ 0000h
SPI1SCKPPS_SPI1SCKPPS0_POSITION          equ 0000h
SPI1SCKPPS_SPI1SCKPPS0_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS0_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS0_MASK              equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_POSN              equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_POSITION          equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS1_MASK              equ 0002h
SPI1SCKPPS_SPI1SCKPPS2_POSN              equ 0002h
SPI1SCKPPS_SPI1SCKPPS2_POSITION          equ 0002h
SPI1SCKPPS_SPI1SCKPPS2_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS2_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS2_MASK              equ 0004h
SPI1SCKPPS_SPI1SCKPPS3_POSN              equ 0003h
SPI1SCKPPS_SPI1SCKPPS3_POSITION          equ 0003h
SPI1SCKPPS_SPI1SCKPPS3_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS3_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS3_MASK              equ 0008h
SPI1SCKPPS_SPI1SCKPPS4_POSN              equ 0004h
SPI1SCKPPS_SPI1SCKPPS4_POSITION          equ 0004h
SPI1SCKPPS_SPI1SCKPPS4_SIZE              equ 0001h
SPI1SCKPPS_SPI1SCKPPS4_LENGTH            equ 0001h
SPI1SCKPPS_SPI1SCKPPS4_MASK              equ 0010h

