GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: U3BRG
#define U3BRG U3BRG
U3BRG                                    equ 02D4h

// Register: U3BRGL
#define U3BRGL U3BRGL
U3BRGL                                   equ 02D4h
// bitfield definitions
U3BRGL_BRGL_POSN                         equ 0000h
U3BRGL_BRGL_POSITION                     equ 0000h
U3BRGL_BRGL_SIZE                         equ 0008h
U3BRGL_BRGL_LENGTH                       equ 0008h
U3BRGL_BRGL_MASK                         equ 00FFh

// Register: U3BRGH
#define U3BRGH U3BRGH
U3BRGH                                   equ 02D5h
// bitfield definitions
U3BRGH_BRGH_POSN                         equ 0000h
U3BRGH_BRGH_POSITION                     equ 0000h
U3BRGH_BRGH_SIZE                         equ 0008h
U3BRGH_BRGH_LENGTH                       equ 0008h
U3BRGH_BRGH_MASK                         equ 00FFh

// Register: U3FIFO
#define U3FIFO U3FIFO
U3FIFO                                   equ 02D6h
// bitfield definitions
U3FIFO_RXBF_POSN                         equ 0000h
U3FIFO_RXBF_POSITION                     equ 0000h
U3FIFO_RXBF_SIZE                         equ 0001h
U3FIFO_RXBF_LENGTH                       equ 0001h
U3FIFO_RXBF_MASK                         equ 0001h
U3FIFO_RXBE_POSN                         equ 0001h
U3FIFO_RXBE_POSITION                     equ 0001h
U3FIFO_RXBE_SIZE                         equ 0001h
U3FIFO_RXBE_LENGTH                       equ 0001h
U3FIFO_RXBE_MASK                         equ 0002h
U3FIFO_XON_POSN                          equ 0002h
U3FIFO_XON_POSITION                      equ 0002h
U3FIFO_XON_SIZE                          equ 0001h
U3FIFO_XON_LENGTH                        equ 0001h
U3FIFO_XON_MASK                          equ 0004h
U3FIFO_RXIDL_POSN                        equ 0003h
U3FIFO_RXIDL_POSITION                    equ 0003h
U3FIFO_RXIDL_SIZE                        equ 0001h
U3FIFO_RXIDL_LENGTH                      equ 0001h
U3FIFO_RXIDL_MASK                        equ 0008h
U3FIFO_TXBF_POSN                         equ 0004h
U3FIFO_TXBF_POSITION                     equ 0004h
U3FIFO_TXBF_SIZE                         equ 0001h
U3FIFO_TXBF_LENGTH                       equ 0001h
U3FIFO_TXBF_MASK                         equ 0010h
U3FIFO_TXBE_POSN                         equ 0005h
U3FIFO_TXBE_POSITION                     equ 0005h
U3FIFO_TXBE_SIZE                         equ 0001h
U3FIFO_TXBE_LENGTH                       equ 0001h
U3FIFO_TXBE_MASK                         equ 0020h
U3FIFO_STPMD_POSN                        equ 0006h
U3FIFO_STPMD_POSITION                    equ 0006h
U3FIFO_STPMD_SIZE                        equ 0001h
U3FIFO_STPMD_LENGTH                      equ 0001h
U3FIFO_STPMD_MASK                        equ 0040h
U3FIFO_TXWRE_POSN                        equ 0007h
U3FIFO_TXWRE_POSITION                    equ 0007h
U3FIFO_TXWRE_SIZE                        equ 0001h
U3FIFO_TXWRE_LENGTH                      equ 0001h
U3FIFO_TXWRE_MASK                        equ 0080h
U3FIFO_U3RXBF_POSN                       equ 0000h
U3FIFO_U3RXBF_POSITION                   equ 0000h
U3FIFO_U3RXBF_SIZE                       equ 0001h
U3FIFO_U3RXBF_LENGTH                     equ 0001h
U3FIFO_U3RXBF_MASK                       equ 0001h
U3FIFO_U3RXBE_POSN                       equ 0001h
U3FIFO_U3RXBE_POSITION                   equ 0001h
U3FIFO_U3RXBE_SIZE                       equ 0001h
U3FIFO_U3RXBE_LENGTH                     equ 0001h
U3FIFO_U3RXBE_MASK                       equ 0002h
U3FIFO_U3XON_POSN                        equ 0002h
U3FIFO_U3XON_POSITION                    equ 0002h
U3FIFO_U3XON_SIZE                        equ 0001h
U3FIFO_U3XON_LENGTH                      equ 0001h
U3FIFO_U3XON_MASK                        equ 0004h
U3FIFO_U3RXIDL_POSN                      equ 0003h
U3FIFO_U3RXIDL_POSITION                  equ 0003h
U3FIFO_U3RXIDL_SIZE                      equ 0001h
U3FIFO_U3RXIDL_LENGTH                    equ 0001h
U3FIFO_U3RXIDL_MASK                      equ 0008h
U3FIFO_U3TXBF_POSN                       equ 0004h
U3FIFO_U3TXBF_POSITION                   equ 0004h
U3FIFO_U3TXBF_SIZE                       equ 0001h
U3FIFO_U3TXBF_LENGTH                     equ 0001h
U3FIFO_U3TXBF_MASK                       equ 0010h
U3FIFO_U3TXBE_POSN                       equ 0005h
U3FIFO_U3TXBE_POSITION                   equ 0005h
U3FIFO_U3TXBE_SIZE                       equ 0001h
U3FIFO_U3TXBE_LENGTH                     equ 0001h
U3FIFO_U3TXBE_MASK                       equ 0020h
U3FIFO_U3STPMD_POSN                      equ 0006h
U3FIFO_U3STPMD_POSITION                  equ 0006h
U3FIFO_U3STPMD_SIZE                      equ 0001h
U3FIFO_U3STPMD_LENGTH                    equ 0001h
U3FIFO_U3STPMD_MASK                      equ 0040h
U3FIFO_U3TXWRE_POSN                      equ 0007h
U3FIFO_U3TXWRE_POSITION                  equ 0007h
U3FIFO_U3TXWRE_SIZE                      equ 0001h
U3FIFO_U3TXWRE_LENGTH                    equ 0001h
U3FIFO_U3TXWRE_MASK                      equ 0080h
U3FIFO_U3RCIDL_POSN                      equ 0003h
U3FIFO_U3RCIDL_POSITION                  equ 0003h
U3FIFO_U3RCIDL_SIZE                      equ 0001h
U3FIFO_U3RCIDL_LENGTH                    equ 0001h
U3FIFO_U3RCIDL_MASK                      equ 0008h
U3FIFO_RCIDL_POSN                        equ 0003h
U3FIFO_RCIDL_POSITION                    equ 0003h
U3FIFO_RCIDL_SIZE                        equ 0001h
U3FIFO_RCIDL_LENGTH                      equ 0001h
U3FIFO_RCIDL_MASK                        equ 0008h

// Register: U3UIR
#define U3UIR U3UIR
U3UIR                                    equ 02D7h
// bitfield definitions
U3UIR_ABDIE_POSN                         equ 0002h
U3UIR_ABDIE_POSITION                     equ 0002h
U3UIR_ABDIE_SIZE                         equ 0001h
U3UIR_ABDIE_LENGTH                       equ 0001h
U3UIR_ABDIE_MASK                         equ 0004h
U3UIR_ABDIF_POSN                         equ 0006h
U3UIR_ABDIF_POSITION                     equ 0006h
U3UIR_ABDIF_SIZE                         equ 0001h
U3UIR_ABDIF_LENGTH                       equ 0001h
U3UIR_ABDIF_MASK                         equ 0040h
U3UIR_WUIF_POSN                          equ 0007h
U3UIR_WUIF_POSITION                      equ 0007h
U3UIR_WUIF_SIZE                          equ 0001h
U3UIR_WUIF_LENGTH                        equ 0001h
U3UIR_WUIF_MASK                          equ 0080h
U3UIR_U3ABDIE_POSN                       equ 0002h
U3UIR_U3ABDIE_POSITION                   equ 0002h
U3UIR_U3ABDIE_SIZE                       equ 0001h
U3UIR_U3ABDIE_LENGTH                     equ 0001h
U3UIR_U3ABDIE_MASK                       equ 0004h
U3UIR_U3ABDIF_POSN                       equ 0006h
U3UIR_U3ABDIF_POSITION                   equ 0006h
U3UIR_U3ABDIF_SIZE                       equ 0001h
U3UIR_U3ABDIF_LENGTH                     equ 0001h
U3UIR_U3ABDIF_MASK                       equ 0040h
U3UIR_U3WUIF_POSN                        equ 0007h
U3UIR_U3WUIF_POSITION                    equ 0007h
U3UIR_U3WUIF_SIZE                        equ 0001h
U3UIR_U3WUIF_LENGTH                      equ 0001h
U3UIR_U3WUIF_MASK                        equ 0080h

// Register: U3ERRIR
#define U3ERRIR U3ERRIR
U3ERRIR                                  equ 02D8h
// bitfield definitions
U3ERRIR_TXCIF_POSN                       equ 0000h
U3ERRIR_TXCIF_POSITION                   equ 0000h
U3ERRIR_TXCIF_SIZE                       equ 0001h
U3ERRIR_TXCIF_LENGTH                     equ 0001h
U3ERRIR_TXCIF_MASK                       equ 0001h
U3ERRIR_RXFOIF_POSN                      equ 0001h
U3ERRIR_RXFOIF_POSITION                  equ 0001h
U3ERRIR_RXFOIF_SIZE                      equ 0001h
U3ERRIR_RXFOIF_LENGTH                    equ 0001h
U3ERRIR_RXFOIF_MASK                      equ 0002h
U3ERRIR_RXBKIF_POSN                      equ 0002h
U3ERRIR_RXBKIF_POSITION                  equ 0002h
U3ERRIR_RXBKIF_SIZE                      equ 0001h
U3ERRIR_RXBKIF_LENGTH                    equ 0001h
U3ERRIR_RXBKIF_MASK                      equ 0004h
U3ERRIR_FERIF_POSN                       equ 0003h
U3ERRIR_FERIF_POSITION                   equ 0003h
U3ERRIR_FERIF_SIZE                       equ 0001h
U3ERRIR_FERIF_LENGTH                     equ 0001h
U3ERRIR_FERIF_MASK                       equ 0008h
U3ERRIR_CERIF_POSN                       equ 0004h
U3ERRIR_CERIF_POSITION                   equ 0004h
U3ERRIR_CERIF_SIZE                       equ 0001h
U3ERRIR_CERIF_LENGTH                     equ 0001h
U3ERRIR_CERIF_MASK                       equ 0010h
U3ERRIR_ABDOVF_POSN                      equ 0005h
U3ERRIR_ABDOVF_POSITION                  equ 0005h
U3ERRIR_ABDOVF_SIZE                      equ 0001h
U3ERRIR_ABDOVF_LENGTH                    equ 0001h
U3ERRIR_ABDOVF_MASK                      equ 0020h
U3ERRIR_PERIF_POSN                       equ 0006h
U3ERRIR_PERIF_POSITION                   equ 0006h
U3ERRIR_PERIF_SIZE                       equ 0001h
U3ERRIR_PERIF_LENGTH                     equ 0001h
U3ERRIR_PERIF_MASK                       equ 0040h
U3ERRIR_TXMTIF_POSN                      equ 0007h
U3ERRIR_TXMTIF_POSITION                  equ 0007h
U3ERRIR_TXMTIF_SIZE                      equ 0001h
U3ERRIR_TXMTIF_LENGTH                    equ 0001h
U3ERRIR_TXMTIF_MASK                      equ 0080h
U3ERRIR_U3TXCIF_POSN                     equ 0000h
U3ERRIR_U3TXCIF_POSITION                 equ 0000h
U3ERRIR_U3TXCIF_SIZE                     equ 0001h
U3ERRIR_U3TXCIF_LENGTH                   equ 0001h
U3ERRIR_U3TXCIF_MASK                     equ 0001h
U3ERRIR_U3RXFOIF_POSN                    equ 0001h
U3ERRIR_U3RXFOIF_POSITION                equ 0001h
U3ERRIR_U3RXFOIF_SIZE                    equ 0001h
U3ERRIR_U3RXFOIF_LENGTH                  equ 0001h
U3ERRIR_U3RXFOIF_MASK                    equ 0002h
U3ERRIR_U3RXBKIF_POSN                    equ 0002h
U3ERRIR_U3RXBKIF_POSITION                equ 0002h
U3ERRIR_U3RXBKIF_SIZE                    equ 0001h
U3ERRIR_U3RXBKIF_LENGTH                  equ 0001h
U3ERRIR_U3RXBKIF_MASK                    equ 0004h
U3ERRIR_U3FERIF_POSN                     equ 0003h
U3ERRIR_U3FERIF_POSITION                 equ 0003h
U3ERRIR_U3FERIF_SIZE                     equ 0001h
U3ERRIR_U3FERIF_LENGTH                   equ 0001h
U3ERRIR_U3FERIF_MASK                     equ 0008h
U3ERRIR_U3CERIF_POSN                     equ 0004h
U3ERRIR_U3CERIF_POSITION                 equ 0004h
U3ERRIR_U3CERIF_SIZE                     equ 0001h
U3ERRIR_U3CERIF_LENGTH                   equ 0001h
U3ERRIR_U3CERIF_MASK                     equ 0010h
U3ERRIR_U3ABDOVF_POSN                    equ 0005h
U3ERRIR_U3ABDOVF_POSITION                equ 0005h
U3ERRIR_U3ABDOVF_SIZE                    equ 0001h
U3ERRIR_U3ABDOVF_LENGTH                  equ 0001h
U3ERRIR_U3ABDOVF_MASK                    equ 0020h
U3ERRIR_U3PERIF_POSN                     equ 0006h
U3ERRIR_U3PERIF_POSITION                 equ 0006h
U3ERRIR_U3PERIF_SIZE                     equ 0001h
U3ERRIR_U3PERIF_LENGTH                   equ 0001h
U3ERRIR_U3PERIF_MASK                     equ 0040h
U3ERRIR_U3TXMTIF_POSN                    equ 0007h
U3ERRIR_U3TXMTIF_POSITION                equ 0007h
U3ERRIR_U3TXMTIF_SIZE                    equ 0001h
U3ERRIR_U3TXMTIF_LENGTH                  equ 0001h
U3ERRIR_U3TXMTIF_MASK                    equ 0080h

