GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: U5BRG
#define U5BRG U5BRG
U5BRG                                    equ 02FAh

// Register: U5BRGL
#define U5BRGL U5BRGL
U5BRGL                                   equ 02FAh
// bitfield definitions
U5BRGL_BRGL_POSN                         equ 0000h
U5BRGL_BRGL_POSITION                     equ 0000h
U5BRGL_BRGL_SIZE                         equ 0008h
U5BRGL_BRGL_LENGTH                       equ 0008h
U5BRGL_BRGL_MASK                         equ 00FFh

// Register: U5BRGH
#define U5BRGH U5BRGH
U5BRGH                                   equ 02FBh
// bitfield definitions
U5BRGH_BRGH_POSN                         equ 0000h
U5BRGH_BRGH_POSITION                     equ 0000h
U5BRGH_BRGH_SIZE                         equ 0008h
U5BRGH_BRGH_LENGTH                       equ 0008h
U5BRGH_BRGH_MASK                         equ 00FFh

// Register: U5FIFO
#define U5FIFO U5FIFO
U5FIFO                                   equ 02FCh
// bitfield definitions
U5FIFO_RXBF_POSN                         equ 0000h
U5FIFO_RXBF_POSITION                     equ 0000h
U5FIFO_RXBF_SIZE                         equ 0001h
U5FIFO_RXBF_LENGTH                       equ 0001h
U5FIFO_RXBF_MASK                         equ 0001h
U5FIFO_RXBE_POSN                         equ 0001h
U5FIFO_RXBE_POSITION                     equ 0001h
U5FIFO_RXBE_SIZE                         equ 0001h
U5FIFO_RXBE_LENGTH                       equ 0001h
U5FIFO_RXBE_MASK                         equ 0002h
U5FIFO_XON_POSN                          equ 0002h
U5FIFO_XON_POSITION                      equ 0002h
U5FIFO_XON_SIZE                          equ 0001h
U5FIFO_XON_LENGTH                        equ 0001h
U5FIFO_XON_MASK                          equ 0004h
U5FIFO_RXIDL_POSN                        equ 0003h
U5FIFO_RXIDL_POSITION                    equ 0003h
U5FIFO_RXIDL_SIZE                        equ 0001h
U5FIFO_RXIDL_LENGTH                      equ 0001h
U5FIFO_RXIDL_MASK                        equ 0008h
U5FIFO_TXBF_POSN                         equ 0004h
U5FIFO_TXBF_POSITION                     equ 0004h
U5FIFO_TXBF_SIZE                         equ 0001h
U5FIFO_TXBF_LENGTH                       equ 0001h
U5FIFO_TXBF_MASK                         equ 0010h
U5FIFO_TXBE_POSN                         equ 0005h
U5FIFO_TXBE_POSITION                     equ 0005h
U5FIFO_TXBE_SIZE                         equ 0001h
U5FIFO_TXBE_LENGTH                       equ 0001h
U5FIFO_TXBE_MASK                         equ 0020h
U5FIFO_STPMD_POSN                        equ 0006h
U5FIFO_STPMD_POSITION                    equ 0006h
U5FIFO_STPMD_SIZE                        equ 0001h
U5FIFO_STPMD_LENGTH                      equ 0001h
U5FIFO_STPMD_MASK                        equ 0040h
U5FIFO_TXWRE_POSN                        equ 0007h
U5FIFO_TXWRE_POSITION                    equ 0007h
U5FIFO_TXWRE_SIZE                        equ 0001h
U5FIFO_TXWRE_LENGTH                      equ 0001h
U5FIFO_TXWRE_MASK                        equ 0080h
U5FIFO_U5RXBF_POSN                       equ 0000h
U5FIFO_U5RXBF_POSITION                   equ 0000h
U5FIFO_U5RXBF_SIZE                       equ 0001h
U5FIFO_U5RXBF_LENGTH                     equ 0001h
U5FIFO_U5RXBF_MASK                       equ 0001h
U5FIFO_U5RXBE_POSN                       equ 0001h
U5FIFO_U5RXBE_POSITION                   equ 0001h
U5FIFO_U5RXBE_SIZE                       equ 0001h
U5FIFO_U5RXBE_LENGTH                     equ 0001h
U5FIFO_U5RXBE_MASK                       equ 0002h
U5FIFO_U5XON_POSN                        equ 0002h
U5FIFO_U5XON_POSITION                    equ 0002h
U5FIFO_U5XON_SIZE                        equ 0001h
U5FIFO_U5XON_LENGTH                      equ 0001h
U5FIFO_U5XON_MASK                        equ 0004h
U5FIFO_U5RXIDL_POSN                      equ 0003h
U5FIFO_U5RXIDL_POSITION                  equ 0003h
U5FIFO_U5RXIDL_SIZE                      equ 0001h
U5FIFO_U5RXIDL_LENGTH                    equ 0001h
U5FIFO_U5RXIDL_MASK                      equ 0008h
U5FIFO_U5TXBF_POSN                       equ 0004h
U5FIFO_U5TXBF_POSITION                   equ 0004h
U5FIFO_U5TXBF_SIZE                       equ 0001h
U5FIFO_U5TXBF_LENGTH                     equ 0001h
U5FIFO_U5TXBF_MASK                       equ 0010h
U5FIFO_U5TXBE_POSN                       equ 0005h
U5FIFO_U5TXBE_POSITION                   equ 0005h
U5FIFO_U5TXBE_SIZE                       equ 0001h
U5FIFO_U5TXBE_LENGTH                     equ 0001h
U5FIFO_U5TXBE_MASK                       equ 0020h
U5FIFO_U5STPMD_POSN                      equ 0006h
U5FIFO_U5STPMD_POSITION                  equ 0006h
U5FIFO_U5STPMD_SIZE                      equ 0001h
U5FIFO_U5STPMD_LENGTH                    equ 0001h
U5FIFO_U5STPMD_MASK                      equ 0040h
U5FIFO_U5TXWRE_POSN                      equ 0007h
U5FIFO_U5TXWRE_POSITION                  equ 0007h
U5FIFO_U5TXWRE_SIZE                      equ 0001h
U5FIFO_U5TXWRE_LENGTH                    equ 0001h
U5FIFO_U5TXWRE_MASK                      equ 0080h
U5FIFO_U5RCIDL_POSN                      equ 0003h
U5FIFO_U5RCIDL_POSITION                  equ 0003h
U5FIFO_U5RCIDL_SIZE                      equ 0001h
U5FIFO_U5RCIDL_LENGTH                    equ 0001h
U5FIFO_U5RCIDL_MASK                      equ 0008h
U5FIFO_RCIDL_POSN                        equ 0003h
U5FIFO_RCIDL_POSITION                    equ 0003h
U5FIFO_RCIDL_SIZE                        equ 0001h
U5FIFO_RCIDL_LENGTH                      equ 0001h
U5FIFO_RCIDL_MASK                        equ 0008h

// Register: U5UIR
#define U5UIR U5UIR
U5UIR                                    equ 02FDh
// bitfield definitions
U5UIR_ABDIE_POSN                         equ 0002h
U5UIR_ABDIE_POSITION                     equ 0002h
U5UIR_ABDIE_SIZE                         equ 0001h
U5UIR_ABDIE_LENGTH                       equ 0001h
U5UIR_ABDIE_MASK                         equ 0004h
U5UIR_ABDIF_POSN                         equ 0006h
U5UIR_ABDIF_POSITION                     equ 0006h
U5UIR_ABDIF_SIZE                         equ 0001h
U5UIR_ABDIF_LENGTH                       equ 0001h
U5UIR_ABDIF_MASK                         equ 0040h
U5UIR_WUIF_POSN                          equ 0007h
U5UIR_WUIF_POSITION                      equ 0007h
U5UIR_WUIF_SIZE                          equ 0001h
U5UIR_WUIF_LENGTH                        equ 0001h
U5UIR_WUIF_MASK                          equ 0080h
U5UIR_U5ABDIE_POSN                       equ 0002h
U5UIR_U5ABDIE_POSITION                   equ 0002h
U5UIR_U5ABDIE_SIZE                       equ 0001h
U5UIR_U5ABDIE_LENGTH                     equ 0001h
U5UIR_U5ABDIE_MASK                       equ 0004h
U5UIR_U5ABDIF_POSN                       equ 0006h
U5UIR_U5ABDIF_POSITION                   equ 0006h
U5UIR_U5ABDIF_SIZE                       equ 0001h
U5UIR_U5ABDIF_LENGTH                     equ 0001h
U5UIR_U5ABDIF_MASK                       equ 0040h
U5UIR_U5WUIF_POSN                        equ 0007h
U5UIR_U5WUIF_POSITION                    equ 0007h
U5UIR_U5WUIF_SIZE                        equ 0001h
U5UIR_U5WUIF_LENGTH                      equ 0001h
U5UIR_U5WUIF_MASK                        equ 0080h

// Register: U5ERRIR
#define U5ERRIR U5ERRIR
U5ERRIR                                  equ 02FEh
// bitfield definitions
U5ERRIR_TXCIF_POSN                       equ 0000h
U5ERRIR_TXCIF_POSITION                   equ 0000h
U5ERRIR_TXCIF_SIZE                       equ 0001h
U5ERRIR_TXCIF_LENGTH                     equ 0001h
U5ERRIR_TXCIF_MASK                       equ 0001h
U5ERRIR_RXFOIF_POSN                      equ 0001h
U5ERRIR_RXFOIF_POSITION                  equ 0001h
U5ERRIR_RXFOIF_SIZE                      equ 0001h
U5ERRIR_RXFOIF_LENGTH                    equ 0001h
U5ERRIR_RXFOIF_MASK                      equ 0002h
U5ERRIR_RXBKIF_POSN                      equ 0002h
U5ERRIR_RXBKIF_POSITION                  equ 0002h
U5ERRIR_RXBKIF_SIZE                      equ 0001h
U5ERRIR_RXBKIF_LENGTH                    equ 0001h
U5ERRIR_RXBKIF_MASK                      equ 0004h
U5ERRIR_FERIF_POSN                       equ 0003h
U5ERRIR_FERIF_POSITION                   equ 0003h
U5ERRIR_FERIF_SIZE                       equ 0001h
U5ERRIR_FERIF_LENGTH                     equ 0001h
U5ERRIR_FERIF_MASK                       equ 0008h
U5ERRIR_CERIF_POSN                       equ 0004h
U5ERRIR_CERIF_POSITION                   equ 0004h
U5ERRIR_CERIF_SIZE                       equ 0001h
U5ERRIR_CERIF_LENGTH                     equ 0001h
U5ERRIR_CERIF_MASK                       equ 0010h
U5ERRIR_ABDOVF_POSN                      equ 0005h
U5ERRIR_ABDOVF_POSITION                  equ 0005h
U5ERRIR_ABDOVF_SIZE                      equ 0001h
U5ERRIR_ABDOVF_LENGTH                    equ 0001h
U5ERRIR_ABDOVF_MASK                      equ 0020h
U5ERRIR_PERIF_POSN                       equ 0006h
U5ERRIR_PERIF_POSITION                   equ 0006h
U5ERRIR_PERIF_SIZE                       equ 0001h
U5ERRIR_PERIF_LENGTH                     equ 0001h
U5ERRIR_PERIF_MASK                       equ 0040h
U5ERRIR_TXMTIF_POSN                      equ 0007h
U5ERRIR_TXMTIF_POSITION                  equ 0007h
U5ERRIR_TXMTIF_SIZE                      equ 0001h
U5ERRIR_TXMTIF_LENGTH                    equ 0001h
U5ERRIR_TXMTIF_MASK                      equ 0080h
U5ERRIR_U5TXCIF_POSN                     equ 0000h
U5ERRIR_U5TXCIF_POSITION                 equ 0000h
U5ERRIR_U5TXCIF_SIZE                     equ 0001h
U5ERRIR_U5TXCIF_LENGTH                   equ 0001h
U5ERRIR_U5TXCIF_MASK                     equ 0001h
U5ERRIR_U5RXFOIF_POSN                    equ 0001h
U5ERRIR_U5RXFOIF_POSITION                equ 0001h
U5ERRIR_U5RXFOIF_SIZE                    equ 0001h
U5ERRIR_U5RXFOIF_LENGTH                  equ 0001h
U5ERRIR_U5RXFOIF_MASK                    equ 0002h
U5ERRIR_U5RXBKIF_POSN                    equ 0002h
U5ERRIR_U5RXBKIF_POSITION                equ 0002h
U5ERRIR_U5RXBKIF_SIZE                    equ 0001h
U5ERRIR_U5RXBKIF_LENGTH                  equ 0001h
U5ERRIR_U5RXBKIF_MASK                    equ 0004h
U5ERRIR_U5FERIF_POSN                     equ 0003h
U5ERRIR_U5FERIF_POSITION                 equ 0003h
U5ERRIR_U5FERIF_SIZE                     equ 0001h
U5ERRIR_U5FERIF_LENGTH                   equ 0001h
U5ERRIR_U5FERIF_MASK                     equ 0008h
U5ERRIR_U5CERIF_POSN                     equ 0004h
U5ERRIR_U5CERIF_POSITION                 equ 0004h
U5ERRIR_U5CERIF_SIZE                     equ 0001h
U5ERRIR_U5CERIF_LENGTH                   equ 0001h
U5ERRIR_U5CERIF_MASK                     equ 0010h
U5ERRIR_U5ABDOVF_POSN                    equ 0005h
U5ERRIR_U5ABDOVF_POSITION                equ 0005h
U5ERRIR_U5ABDOVF_SIZE                    equ 0001h
U5ERRIR_U5ABDOVF_LENGTH                  equ 0001h
U5ERRIR_U5ABDOVF_MASK                    equ 0020h
U5ERRIR_U5PERIF_POSN                     equ 0006h
U5ERRIR_U5PERIF_POSITION                 equ 0006h
U5ERRIR_U5PERIF_SIZE                     equ 0001h
U5ERRIR_U5PERIF_LENGTH                   equ 0001h
U5ERRIR_U5PERIF_MASK                     equ 0040h
U5ERRIR_U5TXMTIF_POSN                    equ 0007h
U5ERRIR_U5TXMTIF_POSITION                equ 0007h
U5ERRIR_U5TXMTIF_SIZE                    equ 0001h
U5ERRIR_U5TXMTIF_LENGTH                  equ 0001h
U5ERRIR_U5TXMTIF_MASK                    equ 0080h

// Register: U5ERRIE
#define U5ERRIE U5ERRIE
U5ERRIE                                  equ 02FFh
// bitfield definitions
U5ERRIE_TXCIE_POSN                       equ 0000h
U5ERRIE_TXCIE_POSITION                   equ 0000h
U5ERRIE_TXCIE_SIZE                       equ 0001h
U5ERRIE_TXCIE_LENGTH                     equ 0001h
U5ERRIE_TXCIE_MASK                       equ 0001h
U5ERRIE_RXFOIE_POSN                      equ 0001h
U5ERRIE_RXFOIE_POSITION                  equ 0001h
U5ERRIE_RXFOIE_SIZE                      equ 0001h
U5ERRIE_RXFOIE_LENGTH                    equ 0001h
U5ERRIE_RXFOIE_MASK                      equ 0002h
U5ERRIE_RXBKIE_POSN                      equ 0002h
U5ERRIE_RXBKIE_POSITION                  equ 0002h
U5ERRIE_RXBKIE_SIZE                      equ 0001h
U5ERRIE_RXBKIE_LENGTH                    equ 0001h
U5ERRIE_RXBKIE_MASK                      equ 0004h
U5ERRIE_FERIE_POSN                       equ 0003h
U5ERRIE_FERIE_POSITION                   equ 0003h
U5ERRIE_FERIE_SIZE                       equ 0001h
U5ERRIE_FERIE_LENGTH                     equ 0001h
U5ERRIE_FERIE_MASK                       equ 0008h
U5ERRIE_CERIE_POSN                       equ 0004h
U5ERRIE_CERIE_POSITION                   equ 0004h
U5ERRIE_CERIE_SIZE                       equ 0001h
U5ERRIE_CERIE_LENGTH                     equ 0001h
U5ERRIE_CERIE_MASK                       equ 0010h
U5ERRIE_ABDOVE_POSN                      equ 0005h
U5ERRIE_ABDOVE_POSITION                  equ 0005h
U5ERRIE_ABDOVE_SIZE                      equ 0001h
U5ERRIE_ABDOVE_LENGTH                    equ 0001h
U5ERRIE_ABDOVE_MASK                      equ 0020h
U5ERRIE_PERIE_POSN                       equ 0006h
U5ERRIE_PERIE_POSITION                   equ 0006h
U5ERRIE_PERIE_SIZE                       equ 0001h
U5ERRIE_PERIE_LENGTH                     equ 0001h
U5ERRIE_PERIE_MASK                       equ 0040h
U5ERRIE_TXMTIE_POSN                      equ 0007h
U5ERRIE_TXMTIE_POSITION                  equ 0007h
U5ERRIE_TXMTIE_SIZE                      equ 0001h
U5ERRIE_TXMTIE_LENGTH                    equ 0001h
U5ERRIE_TXMTIE_MASK                      equ 0080h
U5ERRIE_U5TXCIE_POSN                     equ 0000h
U5ERRIE_U5TXCIE_POSITION                 equ 0000h
U5ERRIE_U5TXCIE_SIZE                     equ 0001h
U5ERRIE_U5TXCIE_LENGTH                   equ 0001h
U5ERRIE_U5TXCIE_MASK                     equ 0001h
U5ERRIE_U5RXFOIE_POSN                    equ 0001h
U5ERRIE_U5RXFOIE_POSITION                equ 0001h
U5ERRIE_U5RXFOIE_SIZE                    equ 0001h
U5ERRIE_U5RXFOIE_LENGTH                  equ 0001h
U5ERRIE_U5RXFOIE_MASK                    equ 0002h
U5ERRIE_U5RXBKIE_POSN                    equ 0002h
U5ERRIE_U5RXBKIE_POSITION                equ 0002h
U5ERRIE_U5RXBKIE_SIZE                    equ 0001h
U5ERRIE_U5RXBKIE_LENGTH                  equ 0001h
U5ERRIE_U5RXBKIE_MASK                    equ 0004h
U5ERRIE_U5FERIE_POSN                     equ 0003h
U5ERRIE_U5FERIE_POSITION                 equ 0003h
U5ERRIE_U5FERIE_SIZE                     equ 0001h
U5ERRIE_U5FERIE_LENGTH                   equ 0001h
U5ERRIE_U5FERIE_MASK                     equ 0008h
U5ERRIE_U5CERIE_POSN                     equ 0004h
U5ERRIE_U5CERIE_POSITION                 equ 0004h
U5ERRIE_U5CERIE_SIZE                     equ 0001h
U5ERRIE_U5CERIE_LENGTH                   equ 0001h
U5ERRIE_U5CERIE_MASK                     equ 0010h
U5ERRIE_U5ABDOVE_POSN                    equ 0005h
U5ERRIE_U5ABDOVE_POSITION                equ 0005h
U5ERRIE_U5ABDOVE_SIZE                    equ 0001h
U5ERRIE_U5ABDOVE_LENGTH                  equ 0001h
U5ERRIE_U5ABDOVE_MASK                    equ 0020h
U5ERRIE_U5PERIE_POSN                     equ 0006h
U5ERRIE_U5PERIE_POSITION                 equ 0006h
U5ERRIE_U5PERIE_SIZE                     equ 0001h
U5ERRIE_U5PERIE_LENGTH                   equ 0001h
U5ERRIE_U5PERIE_MASK                     equ 0040h
U5ERRIE_U5TXMTIE_POSN                    equ 0007h
U5ERRIE_U5TXMTIE_POSITION                equ 0007h
U5ERRIE_U5TXMTIE_SIZE                    equ 0001h
U5ERRIE_U5TXMTIE_LENGTH                  equ 0001h
U5ERRIE_U5TXMTIE_MASK                    equ 0080h

// Register: SMT1TMR
#define SMT1TMR SMT1TMR
SMT1TMR                                  equ 0300h

