GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 0366h
// bitfield definitions
IPR4_U1RXIP_POSN                         equ 0000h
IPR4_U1RXIP_POSITION                     equ 0000h
IPR4_U1RXIP_SIZE                         equ 0001h
IPR4_U1RXIP_LENGTH                       equ 0001h
IPR4_U1RXIP_MASK                         equ 0001h
IPR4_U1TXIP_POSN                         equ 0001h
IPR4_U1TXIP_POSITION                     equ 0001h
IPR4_U1TXIP_SIZE                         equ 0001h
IPR4_U1TXIP_LENGTH                       equ 0001h
IPR4_U1TXIP_MASK                         equ 0002h
IPR4_U1EIP_POSN                          equ 0002h
IPR4_U1EIP_POSITION                      equ 0002h
IPR4_U1EIP_SIZE                          equ 0001h
IPR4_U1EIP_LENGTH                        equ 0001h
IPR4_U1EIP_MASK                          equ 0004h
IPR4_U1IP_POSN                           equ 0003h
IPR4_U1IP_POSITION                       equ 0003h
IPR4_U1IP_SIZE                           equ 0001h
IPR4_U1IP_LENGTH                         equ 0001h
IPR4_U1IP_MASK                           equ 0008h
IPR4_CANRXIP_POSN                        equ 0004h
IPR4_CANRXIP_POSITION                    equ 0004h
IPR4_CANRXIP_SIZE                        equ 0001h
IPR4_CANRXIP_LENGTH                      equ 0001h
IPR4_CANRXIP_MASK                        equ 0010h
IPR4_CANTXIP_POSN                        equ 0005h
IPR4_CANTXIP_POSITION                    equ 0005h
IPR4_CANTXIP_SIZE                        equ 0001h
IPR4_CANTXIP_LENGTH                      equ 0001h
IPR4_CANTXIP_MASK                        equ 0020h
IPR4_PWM1PIP_POSN                        equ 0006h
IPR4_PWM1PIP_POSITION                    equ 0006h
IPR4_PWM1PIP_SIZE                        equ 0001h
IPR4_PWM1PIP_LENGTH                      equ 0001h
IPR4_PWM1PIP_MASK                        equ 0040h
IPR4_PWM1IP_POSN                         equ 0007h
IPR4_PWM1IP_POSITION                     equ 0007h
IPR4_PWM1IP_SIZE                         equ 0001h
IPR4_PWM1IP_LENGTH                       equ 0001h
IPR4_PWM1IP_MASK                         equ 0080h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 0367h
// bitfield definitions
IPR5_SPI2RXIP_POSN                       equ 0000h
IPR5_SPI2RXIP_POSITION                   equ 0000h
IPR5_SPI2RXIP_SIZE                       equ 0001h
IPR5_SPI2RXIP_LENGTH                     equ 0001h
IPR5_SPI2RXIP_MASK                       equ 0001h
IPR5_SPI2TXIP_POSN                       equ 0001h
IPR5_SPI2TXIP_POSITION                   equ 0001h
IPR5_SPI2TXIP_SIZE                       equ 0001h
IPR5_SPI2TXIP_LENGTH                     equ 0001h
IPR5_SPI2TXIP_MASK                       equ 0002h
IPR5_SPI2IP_POSN                         equ 0002h
IPR5_SPI2IP_POSITION                     equ 0002h
IPR5_SPI2IP_SIZE                         equ 0001h
IPR5_SPI2IP_LENGTH                       equ 0001h
IPR5_SPI2IP_MASK                         equ 0004h
IPR5_TU16BIP_POSN                        equ 0003h
IPR5_TU16BIP_POSITION                    equ 0003h
IPR5_TU16BIP_SIZE                        equ 0001h
IPR5_TU16BIP_LENGTH                      equ 0001h
IPR5_TU16BIP_MASK                        equ 0008h
IPR5_TMR3IP_POSN                         equ 0004h
IPR5_TMR3IP_POSITION                     equ 0004h
IPR5_TMR3IP_SIZE                         equ 0001h
IPR5_TMR3IP_LENGTH                       equ 0001h
IPR5_TMR3IP_MASK                         equ 0010h
IPR5_TMR3GIP_POSN                        equ 0005h
IPR5_TMR3GIP_POSITION                    equ 0005h
IPR5_TMR3GIP_SIZE                        equ 0001h
IPR5_TMR3GIP_LENGTH                      equ 0001h
IPR5_TMR3GIP_MASK                        equ 0020h
IPR5_PWM2PIP_POSN                        equ 0006h
IPR5_PWM2PIP_POSITION                    equ 0006h
IPR5_PWM2PIP_SIZE                        equ 0001h
IPR5_PWM2PIP_LENGTH                      equ 0001h
IPR5_PWM2PIP_MASK                        equ 0040h
IPR5_PWM2IP_POSN                         equ 0007h
IPR5_PWM2IP_POSITION                     equ 0007h
IPR5_PWM2IP_SIZE                         equ 0001h
IPR5_PWM2IP_LENGTH                       equ 0001h
IPR5_PWM2IP_MASK                         equ 0080h

// Register: IPR6
#define IPR6 IPR6
IPR6                                     equ 0368h
// bitfield definitions
IPR6_INT1IP_POSN                         equ 0000h
IPR6_INT1IP_POSITION                     equ 0000h
IPR6_INT1IP_SIZE                         equ 0001h
IPR6_INT1IP_LENGTH                       equ 0001h
IPR6_INT1IP_MASK                         equ 0001h
IPR6_CLC2IP_POSN                         equ 0001h
IPR6_CLC2IP_POSITION                     equ 0001h
IPR6_CLC2IP_SIZE                         equ 0001h
IPR6_CLC2IP_LENGTH                       equ 0001h
IPR6_CLC2IP_MASK                         equ 0002h
IPR6_CWG1IP_POSN                         equ 0002h
IPR6_CWG1IP_POSITION                     equ 0002h
IPR6_CWG1IP_SIZE                         equ 0001h
IPR6_CWG1IP_LENGTH                       equ 0001h
IPR6_CWG1IP_MASK                         equ 0004h
IPR6_NCO1IP_POSN                         equ 0003h
IPR6_NCO1IP_POSITION                     equ 0003h
IPR6_NCO1IP_SIZE                         equ 0001h
IPR6_NCO1IP_LENGTH                       equ 0001h
IPR6_NCO1IP_MASK                         equ 0008h
IPR6_DMA2SCNTIP_POSN                     equ 0004h
IPR6_DMA2SCNTIP_POSITION                 equ 0004h
IPR6_DMA2SCNTIP_SIZE                     equ 0001h
IPR6_DMA2SCNTIP_LENGTH                   equ 0001h
IPR6_DMA2SCNTIP_MASK                     equ 0010h
IPR6_DMA2DCNTIP_POSN                     equ 0005h
IPR6_DMA2DCNTIP_POSITION                 equ 0005h
IPR6_DMA2DCNTIP_SIZE                     equ 0001h
IPR6_DMA2DCNTIP_LENGTH                   equ 0001h
IPR6_DMA2DCNTIP_MASK                     equ 0020h
IPR6_DMA2ORIP_POSN                       equ 0006h
IPR6_DMA2ORIP_POSITION                   equ 0006h
IPR6_DMA2ORIP_SIZE                       equ 0001h
IPR6_DMA2ORIP_LENGTH                     equ 0001h
IPR6_DMA2ORIP_MASK                       equ 0040h
IPR6_DMA2AIP_POSN                        equ 0007h
IPR6_DMA2AIP_POSITION                    equ 0007h
IPR6_DMA2AIP_SIZE                        equ 0001h
IPR6_DMA2AIP_LENGTH                      equ 0001h
IPR6_DMA2AIP_MASK                        equ 0080h

// Register: IPR7
#define IPR7 IPR7
IPR7                                     equ 0369h
// bitfield definitions
IPR7_I2C1RXIP_POSN                       equ 0000h
IPR7_I2C1RXIP_POSITION                   equ 0000h
IPR7_I2C1RXIP_SIZE                       equ 0001h
IPR7_I2C1RXIP_LENGTH                     equ 0001h
IPR7_I2C1RXIP_MASK                       equ 0001h
IPR7_I2C1TXIP_POSN                       equ 0001h
IPR7_I2C1TXIP_POSITION                   equ 0001h
IPR7_I2C1TXIP_SIZE                       equ 0001h
IPR7_I2C1TXIP_LENGTH                     equ 0001h
IPR7_I2C1TXIP_MASK                       equ 0002h
IPR7_I2C1IP_POSN                         equ 0002h
IPR7_I2C1IP_POSITION                     equ 0002h
IPR7_I2C1IP_SIZE                         equ 0001h
IPR7_I2C1IP_LENGTH                       equ 0001h
IPR7_I2C1IP_MASK                         equ 0004h
IPR7_I2C1EIP_POSN                        equ 0003h
IPR7_I2C1EIP_POSITION                    equ 0003h
IPR7_I2C1EIP_SIZE                        equ 0001h
IPR7_I2C1EIP_LENGTH                      equ 0001h
IPR7_I2C1EIP_MASK                        equ 0008h
IPR7_CLC3IP_POSN                         equ 0005h
IPR7_CLC3IP_POSITION                     equ 0005h
IPR7_CLC3IP_SIZE                         equ 0001h
IPR7_CLC3IP_LENGTH                       equ 0001h
IPR7_CLC3IP_MASK                         equ 0020h
IPR7_PWM3PIP_POSN                        equ 0006h
IPR7_PWM3PIP_POSITION                    equ 0006h
IPR7_PWM3PIP_SIZE                        equ 0001h
IPR7_PWM3PIP_LENGTH                      equ 0001h
IPR7_PWM3PIP_MASK                        equ 0040h
IPR7_PWM3IP_POSN                         equ 0007h
IPR7_PWM3IP_POSITION                     equ 0007h
IPR7_PWM3IP_SIZE                         equ 0001h
IPR7_PWM3IP_LENGTH                       equ 0001h
IPR7_PWM3IP_MASK                         equ 0080h

// Register: IPR8
#define IPR8 IPR8
IPR8                                     equ 036Ah
// bitfield definitions
IPR8_U2RXIP_POSN                         equ 0000h
IPR8_U2RXIP_POSITION                     equ 0000h
IPR8_U2RXIP_SIZE                         equ 0001h
IPR8_U2RXIP_LENGTH                       equ 0001h
IPR8_U2RXIP_MASK                         equ 0001h
IPR8_U2TXIP_POSN                         equ 0001h
IPR8_U2TXIP_POSITION                     equ 0001h
IPR8_U2TXIP_SIZE                         equ 0001h
IPR8_U2TXIP_LENGTH                       equ 0001h
IPR8_U2TXIP_MASK                         equ 0002h
IPR8_U2EIP_POSN                          equ 0002h
IPR8_U2EIP_POSITION                      equ 0002h
IPR8_U2EIP_SIZE                          equ 0001h
IPR8_U2EIP_LENGTH                        equ 0001h
IPR8_U2EIP_MASK                          equ 0004h
IPR8_U2IP_POSN                           equ 0003h
IPR8_U2IP_POSITION                       equ 0003h
IPR8_U2IP_SIZE                           equ 0001h
IPR8_U2IP_LENGTH                         equ 0001h
IPR8_U2IP_MASK                           equ 0008h
IPR8_TMR5IP_POSN                         equ 0004h
IPR8_TMR5IP_POSITION                     equ 0004h
IPR8_TMR5IP_SIZE                         equ 0001h
IPR8_TMR5IP_LENGTH                       equ 0001h
IPR8_TMR5IP_MASK                         equ 0010h
IPR8_TMR5GIP_POSN                        equ 0005h
IPR8_TMR5GIP_POSITION                    equ 0005h
IPR8_TMR5GIP_SIZE                        equ 0001h
IPR8_TMR5GIP_LENGTH                      equ 0001h
IPR8_TMR5GIP_MASK                        equ 0020h
IPR8_CCP2IP_POSN                         equ 0006h
IPR8_CCP2IP_POSITION                     equ 0006h
IPR8_CCP2IP_SIZE                         equ 0001h
IPR8_CCP2IP_LENGTH                       equ 0001h
IPR8_CCP2IP_MASK                         equ 0040h
IPR8_SCANIP_POSN                         equ 0007h
IPR8_SCANIP_POSITION                     equ 0007h
IPR8_SCANIP_SIZE                         equ 0001h
IPR8_SCANIP_LENGTH                       equ 0001h
IPR8_SCANIP_MASK                         equ 0080h

// Register: IPR9
#define IPR9 IPR9
IPR9                                     equ 036Bh
// bitfield definitions
IPR9_U3RXIP_POSN                         equ 0000h
IPR9_U3RXIP_POSITION                     equ 0000h
IPR9_U3RXIP_SIZE                         equ 0001h
IPR9_U3RXIP_LENGTH                       equ 0001h
IPR9_U3RXIP_MASK                         equ 0001h
IPR9_U3TXIP_POSN                         equ 0001h
IPR9_U3TXIP_POSITION                     equ 0001h
IPR9_U3TXIP_SIZE                         equ 0001h
IPR9_U3TXIP_LENGTH                       equ 0001h
IPR9_U3TXIP_MASK                         equ 0002h
IPR9_U3EIP_POSN                          equ 0002h
IPR9_U3EIP_POSITION                      equ 0002h
IPR9_U3EIP_SIZE                          equ 0001h
IPR9_U3EIP_LENGTH                        equ 0001h
IPR9_U3EIP_MASK                          equ 0004h
IPR9_U3IP_POSN                           equ 0003h
IPR9_U3IP_POSITION                       equ 0003h
IPR9_U3IP_SIZE                           equ 0001h
IPR9_U3IP_LENGTH                         equ 0001h
IPR9_U3IP_MASK                           equ 0008h
IPR9_CLC4IP_POSN                         equ 0005h
IPR9_CLC4IP_POSITION                     equ 0005h
IPR9_CLC4IP_SIZE                         equ 0001h
IPR9_CLC4IP_LENGTH                       equ 0001h
IPR9_CLC4IP_MASK                         equ 0020h
IPR9_PWM4PIP_POSN                        equ 0006h
IPR9_PWM4PIP_POSITION                    equ 0006h
IPR9_PWM4PIP_SIZE                        equ 0001h
IPR9_PWM4PIP_LENGTH                      equ 0001h
IPR9_PWM4PIP_MASK                        equ 0040h
IPR9_PWM4IP_POSN                         equ 0007h
IPR9_PWM4IP_POSITION                     equ 0007h
IPR9_PWM4IP_SIZE                         equ 0001h
IPR9_PWM4IP_LENGTH                       equ 0001h
IPR9_PWM4IP_MASK                         equ 0080h

// Register: IPR10
#define IPR10 IPR10
IPR10                                    equ 036Ch
// bitfield definitions
IPR10_INT2IP_POSN                        equ 0000h
IPR10_INT2IP_POSITION                    equ 0000h
IPR10_INT2IP_SIZE                        equ 0001h
IPR10_INT2IP_LENGTH                      equ 0001h
IPR10_INT2IP_MASK                        equ 0001h
IPR10_CLC5IP_POSN                        equ 0001h
IPR10_CLC5IP_POSITION                    equ 0001h
IPR10_CLC5IP_SIZE                        equ 0001h
IPR10_CLC5IP_LENGTH                      equ 0001h
IPR10_CLC5IP_MASK                        equ 0002h
IPR10_CWG2IP_POSN                        equ 0002h
IPR10_CWG2IP_POSITION                    equ 0002h
IPR10_CWG2IP_SIZE                        equ 0001h
IPR10_CWG2IP_LENGTH                      equ 0001h
IPR10_CWG2IP_MASK                        equ 0004h
IPR10_NCO2IP_POSN                        equ 0003h
IPR10_NCO2IP_POSITION                    equ 0003h
IPR10_NCO2IP_SIZE                        equ 0001h
IPR10_NCO2IP_LENGTH                      equ 0001h
IPR10_NCO2IP_MASK                        equ 0008h
IPR10_DMA3SCNTIP_POSN                    equ 0004h
IPR10_DMA3SCNTIP_POSITION                equ 0004h
IPR10_DMA3SCNTIP_SIZE                    equ 0001h
IPR10_DMA3SCNTIP_LENGTH                  equ 0001h
IPR10_DMA3SCNTIP_MASK                    equ 0010h
IPR10_DMA3DCNTIP_POSN                    equ 0005h
IPR10_DMA3DCNTIP_POSITION                equ 0005h
IPR10_DMA3DCNTIP_SIZE                    equ 0001h
IPR10_DMA3DCNTIP_LENGTH                  equ 0001h
IPR10_DMA3DCNTIP_MASK                    equ 0020h
IPR10_DMA3ORIP_POSN                      equ 0006h
IPR10_DMA3ORIP_POSITION                  equ 0006h
IPR10_DMA3ORIP_SIZE                      equ 0001h
IPR10_DMA3ORIP_LENGTH                    equ 0001h
IPR10_DMA3ORIP_MASK                      equ 0040h
IPR10_DMA3AIP_POSN                       equ 0007h
IPR10_DMA3AIP_POSITION                   equ 0007h
IPR10_DMA3AIP_SIZE                       equ 0001h
IPR10_DMA3AIP_LENGTH                     equ 0001h
IPR10_DMA3AIP_MASK                       equ 0080h

// Register: IPR11
#define IPR11 IPR11
IPR11                                    equ 036Dh
// bitfield definitions
IPR11_CCP3IP_POSN                        equ 0000h
IPR11_CCP3IP_POSITION                    equ 0000h
IPR11_CCP3IP_SIZE                        equ 0001h
IPR11_CCP3IP_LENGTH                      equ 0001h
IPR11_CCP3IP_MASK                        equ 0001h
IPR11_CLC6IP_POSN                        equ 0001h
IPR11_CLC6IP_POSITION                    equ 0001h
IPR11_CLC6IP_SIZE                        equ 0001h
IPR11_CLC6IP_LENGTH                      equ 0001h
IPR11_CLC6IP_MASK                        equ 0002h
IPR11_CWG3IP_POSN                        equ 0002h
IPR11_CWG3IP_POSITION                    equ 0002h
IPR11_CWG3IP_SIZE                        equ 0001h
IPR11_CWG3IP_LENGTH                      equ 0001h
IPR11_CWG3IP_MASK                        equ 0004h
IPR11_TMR4IP_POSN                        equ 0003h
IPR11_TMR4IP_POSITION                    equ 0003h
IPR11_TMR4IP_SIZE                        equ 0001h
IPR11_TMR4IP_LENGTH                      equ 0001h
IPR11_TMR4IP_MASK                        equ 0008h
IPR11_DMA4SCNTIP_POSN                    equ 0004h
IPR11_DMA4SCNTIP_POSITION                equ 0004h
IPR11_DMA4SCNTIP_SIZE                    equ 0001h
IPR11_DMA4SCNTIP_LENGTH                  equ 0001h
IPR11_DMA4SCNTIP_MASK                    equ 0010h
IPR11_DMA4DCNTIP_POSN                    equ 0005h
IPR11_DMA4DCNTIP_POSITION                equ 0005h
IPR11_DMA4DCNTIP_SIZE                    equ 0001h
IPR11_DMA4DCNTIP_LENGTH                  equ 0001h
IPR11_DMA4DCNTIP_MASK                    equ 0020h
IPR11_DMA4ORIP_POSN                      equ 0006h
IPR11_DMA4ORIP_POSITION                  equ 0006h
IPR11_DMA4ORIP_SIZE                      equ 0001h
IPR11_DMA4ORIP_LENGTH                    equ 0001h
IPR11_DMA4ORIP_MASK                      equ 0040h
IPR11_DMA4AIP_POSN                       equ 0007h
IPR11_DMA4AIP_POSITION                   equ 0007h
IPR11_DMA4AIP_SIZE                       equ 0001h
IPR11_DMA4AIP_LENGTH                     equ 0001h
IPR11_DMA4AIP_MASK                       equ 0080h

// Register: IPR12
#define IPR12 IPR12
IPR12                                    equ 036Eh
// bitfield definitions
IPR12_U4RXIP_POSN                        equ 0000h
IPR12_U4RXIP_POSITION                    equ 0000h
IPR12_U4RXIP_SIZE                        equ 0001h
IPR12_U4RXIP_LENGTH                      equ 0001h
IPR12_U4RXIP_MASK                        equ 0001h
IPR12_U4TXIP_POSN                        equ 0001h
IPR12_U4TXIP_POSITION                    equ 0001h
IPR12_U4TXIP_SIZE                        equ 0001h
IPR12_U4TXIP_LENGTH                      equ 0001h
IPR12_U4TXIP_MASK                        equ 0002h
IPR12_U4EIP_POSN                         equ 0002h
IPR12_U4EIP_POSITION                     equ 0002h
IPR12_U4EIP_SIZE                         equ 0001h
IPR12_U4EIP_LENGTH                       equ 0001h
IPR12_U4EIP_MASK                         equ 0004h
IPR12_U4IP_POSN                          equ 0003h
IPR12_U4IP_POSITION                      equ 0003h
IPR12_U4IP_SIZE                          equ 0001h
IPR12_U4IP_LENGTH                        equ 0001h
IPR12_U4IP_MASK                          equ 0008h
IPR12_DMA5SCNTIP_POSN                    equ 0004h
IPR12_DMA5SCNTIP_POSITION                equ 0004h
IPR12_DMA5SCNTIP_SIZE                    equ 0001h
IPR12_DMA5SCNTIP_LENGTH                  equ 0001h
IPR12_DMA5SCNTIP_MASK                    equ 0010h
IPR12_DMA5DCNTIP_POSN                    equ 0005h
IPR12_DMA5DCNTIP_POSITION                equ 0005h
IPR12_DMA5DCNTIP_SIZE                    equ 0001h
IPR12_DMA5DCNTIP_LENGTH                  equ 0001h
IPR12_DMA5DCNTIP_MASK                    equ 0020h
IPR12_DMA5ORIP_POSN                      equ 0006h
IPR12_DMA5ORIP_POSITION                  equ 0006h
IPR12_DMA5ORIP_SIZE                      equ 0001h
IPR12_DMA5ORIP_LENGTH                    equ 0001h
IPR12_DMA5ORIP_MASK                      equ 0040h
IPR12_DMA5AIP_POSN                       equ 0007h
IPR12_DMA5AIP_POSITION                   equ 0007h
IPR12_DMA5AIP_SIZE                       equ 0001h
IPR12_DMA5AIP_LENGTH                     equ 0001h
IPR12_DMA5AIP_MASK                       equ 0080h

// Register: IPR13
#define IPR13 IPR13
IPR13                                    equ 036Fh
// bitfield definitions
IPR13_U5RXIP_POSN                        equ 0000h
IPR13_U5RXIP_POSITION                    equ 0000h
IPR13_U5RXIP_SIZE                        equ 0001h
IPR13_U5RXIP_LENGTH                      equ 0001h
IPR13_U5RXIP_MASK                        equ 0001h
IPR13_U5TXIP_POSN                        equ 0001h
IPR13_U5TXIP_POSITION                    equ 0001h
IPR13_U5TXIP_SIZE                        equ 0001h
IPR13_U5TXIP_LENGTH                      equ 0001h
IPR13_U5TXIP_MASK                        equ 0002h
IPR13_U5EIP_POSN                         equ 0002h
IPR13_U5EIP_POSITION                     equ 0002h
IPR13_U5EIP_SIZE                         equ 0001h
IPR13_U5EIP_LENGTH                       equ 0001h
IPR13_U5EIP_MASK                         equ 0004h
IPR13_U5IP_POSN                          equ 0003h
IPR13_U5IP_POSITION                      equ 0003h
IPR13_U5IP_SIZE                          equ 0001h
IPR13_U5IP_LENGTH                        equ 0001h
IPR13_U5IP_MASK                          equ 0008h
IPR13_DMA6SCNTIP_POSN                    equ 0004h
IPR13_DMA6SCNTIP_POSITION                equ 0004h
IPR13_DMA6SCNTIP_SIZE                    equ 0001h
IPR13_DMA6SCNTIP_LENGTH                  equ 0001h
IPR13_DMA6SCNTIP_MASK                    equ 0010h
IPR13_DMA6DCNTIP_POSN                    equ 0005h
IPR13_DMA6DCNTIP_POSITION                equ 0005h
IPR13_DMA6DCNTIP_SIZE                    equ 0001h
IPR13_DMA6DCNTIP_LENGTH                  equ 0001h
IPR13_DMA6DCNTIP_MASK                    equ 0020h
IPR13_DMA6ORIP_POSN                      equ 0006h
IPR13_DMA6ORIP_POSITION                  equ 0006h
IPR13_DMA6ORIP_SIZE                      equ 0001h
IPR13_DMA6ORIP_LENGTH                    equ 0001h
IPR13_DMA6ORIP_MASK                      equ 0040h
IPR13_DMA6AIP_POSN                       equ 0007h
IPR13_DMA6AIP_POSITION                   equ 0007h
IPR13_DMA6AIP_SIZE                       equ 0001h
IPR13_DMA6AIP_LENGTH                     equ 0001h
IPR13_DMA6AIP_MASK                       equ 0080h

