GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: NCO3ACCU
#define NCO3ACCU NCO3ACCU
NCO3ACCU                                 equ 0452h
// bitfield definitions
NCO3ACCU_ACC_POSN                        equ 0000h
NCO3ACCU_ACC_POSITION                    equ 0000h
NCO3ACCU_ACC_SIZE                        equ 0004h
NCO3ACCU_ACC_LENGTH                      equ 0004h
NCO3ACCU_ACC_MASK                        equ 000Fh
NCO3ACCU_NCO3ACC16_POSN                  equ 0000h
NCO3ACCU_NCO3ACC16_POSITION              equ 0000h
NCO3ACCU_NCO3ACC16_SIZE                  equ 0001h
NCO3ACCU_NCO3ACC16_LENGTH                equ 0001h
NCO3ACCU_NCO3ACC16_MASK                  equ 0001h
NCO3ACCU_NCO3ACC17_POSN                  equ 0001h
NCO3ACCU_NCO3ACC17_POSITION              equ 0001h
NCO3ACCU_NCO3ACC17_SIZE                  equ 0001h
NCO3ACCU_NCO3ACC17_LENGTH                equ 0001h
NCO3ACCU_NCO3ACC17_MASK                  equ 0002h
NCO3ACCU_NCO3ACC18_POSN                  equ 0002h
NCO3ACCU_NCO3ACC18_POSITION              equ 0002h
NCO3ACCU_NCO3ACC18_SIZE                  equ 0001h
NCO3ACCU_NCO3ACC18_LENGTH                equ 0001h
NCO3ACCU_NCO3ACC18_MASK                  equ 0004h
NCO3ACCU_NCO3ACC19_POSN                  equ 0003h
NCO3ACCU_NCO3ACC19_POSITION              equ 0003h
NCO3ACCU_NCO3ACC19_SIZE                  equ 0001h
NCO3ACCU_NCO3ACC19_LENGTH                equ 0001h
NCO3ACCU_NCO3ACC19_MASK                  equ 0008h
NCO3ACCU_ACC16_POSN                      equ 0000h
NCO3ACCU_ACC16_POSITION                  equ 0000h
NCO3ACCU_ACC16_SIZE                      equ 0001h
NCO3ACCU_ACC16_LENGTH                    equ 0001h
NCO3ACCU_ACC16_MASK                      equ 0001h
NCO3ACCU_ACC17_POSN                      equ 0001h
NCO3ACCU_ACC17_POSITION                  equ 0001h
NCO3ACCU_ACC17_SIZE                      equ 0001h
NCO3ACCU_ACC17_LENGTH                    equ 0001h
NCO3ACCU_ACC17_MASK                      equ 0002h
NCO3ACCU_ACC18_POSN                      equ 0002h
NCO3ACCU_ACC18_POSITION                  equ 0002h
NCO3ACCU_ACC18_SIZE                      equ 0001h
NCO3ACCU_ACC18_LENGTH                    equ 0001h
NCO3ACCU_ACC18_MASK                      equ 0004h
NCO3ACCU_ACC19_POSN                      equ 0003h
NCO3ACCU_ACC19_POSITION                  equ 0003h
NCO3ACCU_ACC19_SIZE                      equ 0001h
NCO3ACCU_ACC19_LENGTH                    equ 0001h
NCO3ACCU_ACC19_MASK                      equ 0008h
NCO3ACCU_NCO3ACC_POSN                    equ 0000h
NCO3ACCU_NCO3ACC_POSITION                equ 0000h
NCO3ACCU_NCO3ACC_SIZE                    equ 0004h
NCO3ACCU_NCO3ACC_LENGTH                  equ 0004h
NCO3ACCU_NCO3ACC_MASK                    equ 000Fh

// Register: NCO3INC
#define NCO3INC NCO3INC
NCO3INC                                  equ 0453h

// Register: NCO3INCL
#define NCO3INCL NCO3INCL
NCO3INCL                                 equ 0453h
// bitfield definitions
NCO3INCL_INC_POSN                        equ 0000h
NCO3INCL_INC_POSITION                    equ 0000h
NCO3INCL_INC_SIZE                        equ 0008h
NCO3INCL_INC_LENGTH                      equ 0008h
NCO3INCL_INC_MASK                        equ 00FFh
NCO3INCL_NCO3INC0_POSN                   equ 0000h
NCO3INCL_NCO3INC0_POSITION               equ 0000h
NCO3INCL_NCO3INC0_SIZE                   equ 0001h
NCO3INCL_NCO3INC0_LENGTH                 equ 0001h
NCO3INCL_NCO3INC0_MASK                   equ 0001h
NCO3INCL_NCO3INC1_POSN                   equ 0001h
NCO3INCL_NCO3INC1_POSITION               equ 0001h
NCO3INCL_NCO3INC1_SIZE                   equ 0001h
NCO3INCL_NCO3INC1_LENGTH                 equ 0001h
NCO3INCL_NCO3INC1_MASK                   equ 0002h
NCO3INCL_NCO3INC2_POSN                   equ 0002h
NCO3INCL_NCO3INC2_POSITION               equ 0002h
NCO3INCL_NCO3INC2_SIZE                   equ 0001h
NCO3INCL_NCO3INC2_LENGTH                 equ 0001h
NCO3INCL_NCO3INC2_MASK                   equ 0004h
NCO3INCL_NCO3INC3_POSN                   equ 0003h
NCO3INCL_NCO3INC3_POSITION               equ 0003h
NCO3INCL_NCO3INC3_SIZE                   equ 0001h
NCO3INCL_NCO3INC3_LENGTH                 equ 0001h
NCO3INCL_NCO3INC3_MASK                   equ 0008h
NCO3INCL_NCO3INC4_POSN                   equ 0004h
NCO3INCL_NCO3INC4_POSITION               equ 0004h
NCO3INCL_NCO3INC4_SIZE                   equ 0001h
NCO3INCL_NCO3INC4_LENGTH                 equ 0001h
NCO3INCL_NCO3INC4_MASK                   equ 0010h
NCO3INCL_NCO3INC5_POSN                   equ 0005h
NCO3INCL_NCO3INC5_POSITION               equ 0005h
NCO3INCL_NCO3INC5_SIZE                   equ 0001h
NCO3INCL_NCO3INC5_LENGTH                 equ 0001h
NCO3INCL_NCO3INC5_MASK                   equ 0020h
NCO3INCL_NCO3INC6_POSN                   equ 0006h
NCO3INCL_NCO3INC6_POSITION               equ 0006h
NCO3INCL_NCO3INC6_SIZE                   equ 0001h
NCO3INCL_NCO3INC6_LENGTH                 equ 0001h
NCO3INCL_NCO3INC6_MASK                   equ 0040h
NCO3INCL_NCO3INC7_POSN                   equ 0007h
NCO3INCL_NCO3INC7_POSITION               equ 0007h
NCO3INCL_NCO3INC7_SIZE                   equ 0001h
NCO3INCL_NCO3INC7_LENGTH                 equ 0001h
NCO3INCL_NCO3INC7_MASK                   equ 0080h
NCO3INCL_INC0_POSN                       equ 0000h
NCO3INCL_INC0_POSITION                   equ 0000h
NCO3INCL_INC0_SIZE                       equ 0001h
NCO3INCL_INC0_LENGTH                     equ 0001h
NCO3INCL_INC0_MASK                       equ 0001h
NCO3INCL_INC1_POSN                       equ 0001h
NCO3INCL_INC1_POSITION                   equ 0001h
NCO3INCL_INC1_SIZE                       equ 0001h
NCO3INCL_INC1_LENGTH                     equ 0001h
NCO3INCL_INC1_MASK                       equ 0002h
NCO3INCL_INC2_POSN                       equ 0002h
NCO3INCL_INC2_POSITION                   equ 0002h
NCO3INCL_INC2_SIZE                       equ 0001h
NCO3INCL_INC2_LENGTH                     equ 0001h
NCO3INCL_INC2_MASK                       equ 0004h
NCO3INCL_INC3_POSN                       equ 0003h
NCO3INCL_INC3_POSITION                   equ 0003h
NCO3INCL_INC3_SIZE                       equ 0001h
NCO3INCL_INC3_LENGTH                     equ 0001h
NCO3INCL_INC3_MASK                       equ 0008h
NCO3INCL_INC4_POSN                       equ 0004h
NCO3INCL_INC4_POSITION                   equ 0004h
NCO3INCL_INC4_SIZE                       equ 0001h
NCO3INCL_INC4_LENGTH                     equ 0001h
NCO3INCL_INC4_MASK                       equ 0010h
NCO3INCL_INC5_POSN                       equ 0005h
NCO3INCL_INC5_POSITION                   equ 0005h
NCO3INCL_INC5_SIZE                       equ 0001h
NCO3INCL_INC5_LENGTH                     equ 0001h
NCO3INCL_INC5_MASK                       equ 0020h
NCO3INCL_INC6_POSN                       equ 0006h
NCO3INCL_INC6_POSITION                   equ 0006h
NCO3INCL_INC6_SIZE                       equ 0001h
NCO3INCL_INC6_LENGTH                     equ 0001h
NCO3INCL_INC6_MASK                       equ 0040h
NCO3INCL_INC7_POSN                       equ 0007h
NCO3INCL_INC7_POSITION                   equ 0007h
NCO3INCL_INC7_SIZE                       equ 0001h
NCO3INCL_INC7_LENGTH                     equ 0001h
NCO3INCL_INC7_MASK                       equ 0080h
NCO3INCL_NCO3INC_POSN                    equ 0000h
NCO3INCL_NCO3INC_POSITION                equ 0000h
NCO3INCL_NCO3INC_SIZE                    equ 0008h
NCO3INCL_NCO3INC_LENGTH                  equ 0008h
NCO3INCL_NCO3INC_MASK                    equ 00FFh

// Register: NCO3INCH
#define NCO3INCH NCO3INCH
NCO3INCH                                 equ 0454h
// bitfield definitions
NCO3INCH_INC_POSN                        equ 0000h
NCO3INCH_INC_POSITION                    equ 0000h
NCO3INCH_INC_SIZE                        equ 0008h
NCO3INCH_INC_LENGTH                      equ 0008h
NCO3INCH_INC_MASK                        equ 00FFh
NCO3INCH_NCO3INC8_POSN                   equ 0000h
NCO3INCH_NCO3INC8_POSITION               equ 0000h
NCO3INCH_NCO3INC8_SIZE                   equ 0001h
NCO3INCH_NCO3INC8_LENGTH                 equ 0001h
NCO3INCH_NCO3INC8_MASK                   equ 0001h
NCO3INCH_NCO3INC9_POSN                   equ 0001h
NCO3INCH_NCO3INC9_POSITION               equ 0001h
NCO3INCH_NCO3INC9_SIZE                   equ 0001h
NCO3INCH_NCO3INC9_LENGTH                 equ 0001h
NCO3INCH_NCO3INC9_MASK                   equ 0002h
NCO3INCH_NCO3INC10_POSN                  equ 0002h
NCO3INCH_NCO3INC10_POSITION              equ 0002h
NCO3INCH_NCO3INC10_SIZE                  equ 0001h
NCO3INCH_NCO3INC10_LENGTH                equ 0001h
NCO3INCH_NCO3INC10_MASK                  equ 0004h
NCO3INCH_NCO3INC11_POSN                  equ 0003h
NCO3INCH_NCO3INC11_POSITION              equ 0003h
NCO3INCH_NCO3INC11_SIZE                  equ 0001h
NCO3INCH_NCO3INC11_LENGTH                equ 0001h
NCO3INCH_NCO3INC11_MASK                  equ 0008h
NCO3INCH_NCO3INC12_POSN                  equ 0004h
NCO3INCH_NCO3INC12_POSITION              equ 0004h
NCO3INCH_NCO3INC12_SIZE                  equ 0001h
NCO3INCH_NCO3INC12_LENGTH                equ 0001h
NCO3INCH_NCO3INC12_MASK                  equ 0010h
NCO3INCH_NCO3INC13_POSN                  equ 0005h
NCO3INCH_NCO3INC13_POSITION              equ 0005h
NCO3INCH_NCO3INC13_SIZE                  equ 0001h
NCO3INCH_NCO3INC13_LENGTH                equ 0001h
NCO3INCH_NCO3INC13_MASK                  equ 0020h
NCO3INCH_NCO3INC14_POSN                  equ 0006h
NCO3INCH_NCO3INC14_POSITION              equ 0006h
NCO3INCH_NCO3INC14_SIZE                  equ 0001h
NCO3INCH_NCO3INC14_LENGTH                equ 0001h
NCO3INCH_NCO3INC14_MASK                  equ 0040h
NCO3INCH_NCO3INC15_POSN                  equ 0007h
NCO3INCH_NCO3INC15_POSITION              equ 0007h
NCO3INCH_NCO3INC15_SIZE                  equ 0001h
NCO3INCH_NCO3INC15_LENGTH                equ 0001h
NCO3INCH_NCO3INC15_MASK                  equ 0080h
NCO3INCH_INC8_POSN                       equ 0000h
NCO3INCH_INC8_POSITION                   equ 0000h
NCO3INCH_INC8_SIZE                       equ 0001h
NCO3INCH_INC8_LENGTH                     equ 0001h
NCO3INCH_INC8_MASK                       equ 0001h
NCO3INCH_INC9_POSN                       equ 0001h
NCO3INCH_INC9_POSITION                   equ 0001h
NCO3INCH_INC9_SIZE                       equ 0001h
NCO3INCH_INC9_LENGTH                     equ 0001h
NCO3INCH_INC9_MASK                       equ 0002h
NCO3INCH_INC10_POSN                      equ 0002h
NCO3INCH_INC10_POSITION                  equ 0002h
NCO3INCH_INC10_SIZE                      equ 0001h
NCO3INCH_INC10_LENGTH                    equ 0001h
NCO3INCH_INC10_MASK                      equ 0004h
NCO3INCH_INC11_POSN                      equ 0003h
NCO3INCH_INC11_POSITION                  equ 0003h
NCO3INCH_INC11_SIZE                      equ 0001h
NCO3INCH_INC11_LENGTH                    equ 0001h
NCO3INCH_INC11_MASK                      equ 0008h
NCO3INCH_INC12_POSN                      equ 0004h
NCO3INCH_INC12_POSITION                  equ 0004h
NCO3INCH_INC12_SIZE                      equ 0001h
NCO3INCH_INC12_LENGTH                    equ 0001h
NCO3INCH_INC12_MASK                      equ 0010h
NCO3INCH_INC13_POSN                      equ 0005h
NCO3INCH_INC13_POSITION                  equ 0005h
NCO3INCH_INC13_SIZE                      equ 0001h
NCO3INCH_INC13_LENGTH                    equ 0001h
NCO3INCH_INC13_MASK                      equ 0020h
NCO3INCH_INC14_POSN                      equ 0006h
NCO3INCH_INC14_POSITION                  equ 0006h
NCO3INCH_INC14_SIZE                      equ 0001h
NCO3INCH_INC14_LENGTH                    equ 0001h
NCO3INCH_INC14_MASK                      equ 0040h
NCO3INCH_INC15_POSN                      equ 0007h
NCO3INCH_INC15_POSITION                  equ 0007h
NCO3INCH_INC15_SIZE                      equ 0001h
NCO3INCH_INC15_LENGTH                    equ 0001h
NCO3INCH_INC15_MASK                      equ 0080h
NCO3INCH_NCO3INC_POSN                    equ 0000h
NCO3INCH_NCO3INC_POSITION                equ 0000h
NCO3INCH_NCO3INC_SIZE                    equ 0008h
NCO3INCH_NCO3INC_LENGTH                  equ 0008h
NCO3INCH_NCO3INC_MASK                    equ 00FFh

