GopalSaraf/Practicals/PSDL/include/proc/pic18f57q83.inc
// Register: PWM4PR
#define PWM4PR PWM4PR
PWM4PR                                   equ 0490h

// Register: PWM4PRL
#define PWM4PRL PWM4PRL
PWM4PRL                                  equ 0490h
// bitfield definitions
PWM4PRL_PRL_POSN                         equ 0000h
PWM4PRL_PRL_POSITION                     equ 0000h
PWM4PRL_PRL_SIZE                         equ 0008h
PWM4PRL_PRL_LENGTH                       equ 0008h
PWM4PRL_PRL_MASK                         equ 00FFh

// Register: PWM4PRH
#define PWM4PRH PWM4PRH
PWM4PRH                                  equ 0491h
// bitfield definitions
PWM4PRH_PRH_POSN                         equ 0000h
PWM4PRH_PRH_POSITION                     equ 0000h
PWM4PRH_PRH_SIZE                         equ 0008h
PWM4PRH_PRH_LENGTH                       equ 0008h
PWM4PRH_PRH_MASK                         equ 00FFh

// Register: PWM4CPRE
#define PWM4CPRE PWM4CPRE
PWM4CPRE                                 equ 0492h
// bitfield definitions
PWM4CPRE_CPRE_POSN                       equ 0000h
PWM4CPRE_CPRE_POSITION                   equ 0000h
PWM4CPRE_CPRE_SIZE                       equ 0008h
PWM4CPRE_CPRE_LENGTH                     equ 0008h
PWM4CPRE_CPRE_MASK                       equ 00FFh

// Register: PWM4PIPOS
#define PWM4PIPOS PWM4PIPOS
PWM4PIPOS                                equ 0493h
// bitfield definitions
PWM4PIPOS_PIPOS_POSN                     equ 0000h
PWM4PIPOS_PIPOS_POSITION                 equ 0000h
PWM4PIPOS_PIPOS_SIZE                     equ 0008h
PWM4PIPOS_PIPOS_LENGTH                   equ 0008h
PWM4PIPOS_PIPOS_MASK                     equ 00FFh

// Register: PWM4GIR
#define PWM4GIR PWM4GIR
PWM4GIR                                  equ 0494h
// bitfield definitions
PWM4GIR_S1P1IF_POSN                      equ 0000h
PWM4GIR_S1P1IF_POSITION                  equ 0000h
PWM4GIR_S1P1IF_SIZE                      equ 0001h
PWM4GIR_S1P1IF_LENGTH                    equ 0001h
PWM4GIR_S1P1IF_MASK                      equ 0001h
PWM4GIR_S1P2IF_POSN                      equ 0001h
PWM4GIR_S1P2IF_POSITION                  equ 0001h
PWM4GIR_S1P2IF_SIZE                      equ 0001h
PWM4GIR_S1P2IF_LENGTH                    equ 0001h
PWM4GIR_S1P2IF_MASK                      equ 0002h

// Register: PWM4GIE
#define PWM4GIE PWM4GIE
PWM4GIE                                  equ 0495h
// bitfield definitions
PWM4GIE_S1P1IE_POSN                      equ 0000h
PWM4GIE_S1P1IE_POSITION                  equ 0000h
PWM4GIE_S1P1IE_SIZE                      equ 0001h
PWM4GIE_S1P1IE_LENGTH                    equ 0001h
PWM4GIE_S1P1IE_MASK                      equ 0001h
PWM4GIE_S1P2IE_POSN                      equ 0001h
PWM4GIE_S1P2IE_POSITION                  equ 0001h
PWM4GIE_S1P2IE_SIZE                      equ 0001h
PWM4GIE_S1P2IE_LENGTH                    equ 0001h
PWM4GIE_S1P2IE_MASK                      equ 0002h

// Register: PWM4CON
#define PWM4CON PWM4CON
PWM4CON                                  equ 0496h
// bitfield definitions
PWM4CON_ERSNOW_POSN                      equ 0000h
PWM4CON_ERSNOW_POSITION                  equ 0000h
PWM4CON_ERSNOW_SIZE                      equ 0001h
PWM4CON_ERSNOW_LENGTH                    equ 0001h
PWM4CON_ERSNOW_MASK                      equ 0001h
PWM4CON_ERSPOL_POSN                      equ 0001h
PWM4CON_ERSPOL_POSITION                  equ 0001h
PWM4CON_ERSPOL_SIZE                      equ 0001h
PWM4CON_ERSPOL_LENGTH                    equ 0001h
PWM4CON_ERSPOL_MASK                      equ 0002h
PWM4CON_LD_POSN                          equ 0002h
PWM4CON_LD_POSITION                      equ 0002h
PWM4CON_LD_SIZE                          equ 0001h
PWM4CON_LD_LENGTH                        equ 0001h
PWM4CON_LD_MASK                          equ 0004h
PWM4CON_EN_POSN                          equ 0007h
PWM4CON_EN_POSITION                      equ 0007h
PWM4CON_EN_SIZE                          equ 0001h
PWM4CON_EN_LENGTH                        equ 0001h
PWM4CON_EN_MASK                          equ 0080h

// Register: PWM4S1CFG
#define PWM4S1CFG PWM4S1CFG
PWM4S1CFG                                equ 0497h
// bitfield definitions
PWM4S1CFG_MODE_POSN                      equ 0000h
PWM4S1CFG_MODE_POSITION                  equ 0000h
PWM4S1CFG_MODE_SIZE                      equ 0003h
PWM4S1CFG_MODE_LENGTH                    equ 0003h
PWM4S1CFG_MODE_MASK                      equ 0007h
PWM4S1CFG_PPEN_POSN                      equ 0003h
PWM4S1CFG_PPEN_POSITION                  equ 0003h
PWM4S1CFG_PPEN_SIZE                      equ 0001h
PWM4S1CFG_PPEN_LENGTH                    equ 0001h
PWM4S1CFG_PPEN_MASK                      equ 0008h
PWM4S1CFG_POL1_POSN                      equ 0006h
PWM4S1CFG_POL1_POSITION                  equ 0006h
PWM4S1CFG_POL1_SIZE                      equ 0001h
PWM4S1CFG_POL1_LENGTH                    equ 0001h
PWM4S1CFG_POL1_MASK                      equ 0040h
PWM4S1CFG_POL2_POSN                      equ 0007h
PWM4S1CFG_POL2_POSITION                  equ 0007h
PWM4S1CFG_POL2_SIZE                      equ 0001h
PWM4S1CFG_POL2_LENGTH                    equ 0001h
PWM4S1CFG_POL2_MASK                      equ 0080h
PWM4S1CFG_MODE0_POSN                     equ 0000h
PWM4S1CFG_MODE0_POSITION                 equ 0000h
PWM4S1CFG_MODE0_SIZE                     equ 0001h
PWM4S1CFG_MODE0_LENGTH                   equ 0001h
PWM4S1CFG_MODE0_MASK                     equ 0001h
PWM4S1CFG_MODE1_POSN                     equ 0001h
PWM4S1CFG_MODE1_POSITION                 equ 0001h
PWM4S1CFG_MODE1_SIZE                     equ 0001h
PWM4S1CFG_MODE1_LENGTH                   equ 0001h
PWM4S1CFG_MODE1_MASK                     equ 0002h
PWM4S1CFG_MODE2_POSN                     equ 0002h
PWM4S1CFG_MODE2_POSITION                 equ 0002h
PWM4S1CFG_MODE2_SIZE                     equ 0001h
PWM4S1CFG_MODE2_LENGTH                   equ 0001h
PWM4S1CFG_MODE2_MASK                     equ 0004h

// Register: PWM4S1P1
#define PWM4S1P1 PWM4S1P1
PWM4S1P1                                 equ 0498h

// Register: PWM4S1P1L
#define PWM4S1P1L PWM4S1P1L
PWM4S1P1L                                equ 0498h
// bitfield definitions
PWM4S1P1L_S1P1L_POSN                     equ 0000h
PWM4S1P1L_S1P1L_POSITION                 equ 0000h
PWM4S1P1L_S1P1L_SIZE                     equ 0008h
PWM4S1P1L_S1P1L_LENGTH                   equ 0008h
PWM4S1P1L_S1P1L_MASK                     equ 00FFh

// Register: PWM4S1P1H
#define PWM4S1P1H PWM4S1P1H
PWM4S1P1H                                equ 0499h
// bitfield definitions
PWM4S1P1H_S1P1H_POSN                     equ 0000h
PWM4S1P1H_S1P1H_POSITION                 equ 0000h
PWM4S1P1H_S1P1H_SIZE                     equ 0008h
PWM4S1P1H_S1P1H_LENGTH                   equ 0008h
PWM4S1P1H_S1P1H_MASK                     equ 00FFh

